[Killed] Regex
modules/social/domain/expense.entity.ts:32:22
 
 /** Amount string the entity accepts (and the DB stores). Lets the
  *  unit tests + the use-case talk in the same currency. */
-const AMOUNT_REGEX = /^\d+(\.\d{1,2})?$/;
+const AMOUNT_REGEX = /^\d+(\.\d)?$/;
 const MAX_AMOUNT = 99_999_999.99;
 const CURRENCY_REGEX = /^[A-Z]{3}$/;
killedBy: Expense.create() (unit — domain invariants) happy path returns the input, with currency uppercased
statusReason: ValidationError: Amount must be a positive decimal with at most 2 dp

[Killed] Regex
modules/social/domain/expense.entity.ts:32:22
 
 /** Amount string the entity accepts (and the DB stores). Lets the
  *  unit tests + the use-case talk in the same currency. */
-const AMOUNT_REGEX = /^\d+(\.\d{1,2})?$/;
+const AMOUNT_REGEX = /^\d+(\.\D{1,2})?$/;
 const MAX_AMOUNT = 99_999_999.99;
 const CURRENCY_REGEX = /^[A-Z]{3}$/;
killedBy: Expense.create() (unit — domain invariants) happy path returns the input, with currency uppercased
statusReason: ValidationError: Amount must be a positive decimal with at most 2 dp

[Killed] Regex
modules/social/domain/expense.entity.ts:34:24
  *  unit tests + the use-case talk in the same currency. */
 const AMOUNT_REGEX = /^\d+(\.\d{1,2})?$/;
 const MAX_AMOUNT = 99_999_999.99;
-const CURRENCY_REGEX = /^[A-Z]{3}$/;
+const CURRENCY_REGEX = /^[^A-Z]{3}$/;
 const SHARE_SUM_TOLERANCE = 0.0001;
 
killedBy: Expense.create() (unit — domain invariants) happy path returns the input, with currency uppercased
statusReason: ValidationError: Currency must be ISO 4217 (3 letters)

[Killed] BlockStatement
modules/social/domain/expense.entity.ts:78:51
   readonly createdAt: Date;
   readonly updatedAt: Date;
 
-  private constructor(row: ExpensePersistenceRow) {
-    this.id = row.id;
-    this.tripId = row.tripId;
-    this.paidById = row.paidById;
-    this.amountUsd = row.amountUsd;
-    this.currency = row.currency;
-    this.note = row.note;
-    this.splitShare = row.splitShare;
-    this.createdAt = row.createdAt;
-    this.updatedAt = row.updatedAt;
-  }
+  private constructor(row: ExpensePersistenceRow) {}
 
   /**
killedBy: Expense.fromPersistence() (unit) round-trips a DB row into a class instance with readable fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "exp_1"
Received: undefined

[Killed] BlockStatement
modules/social/domain/expense.entity.ts:108:46
    */
   static create(input: CreateExpenseInput): CreateExpenseInput {
     // I1
-    if (!AMOUNT_REGEX.test(input.amountUsd)) {
-      throw new ValidationError(
-        'Amount must be a positive decimal with at most 2 dp',
-        { amountUsd: ['format: <int>.<up to 2 dp>'] },
-        { amountUsd: input.amountUsd },
-        'INVALID_AMOUNT',
-      );
-    }
+    if (!AMOUNT_REGEX.test(input.amountUsd)) {}
     // I2
     const num = Number(input.amountUsd);
killedBy: Expense.create() (unit — domain invariants) I1 rejects an amount that is not a positive 2-dp decimal
statusReason: Error: Expected Expense.create() to throw INVALID_AMOUNT, but it succeeded

[Killed] ConditionalExpression
modules/social/domain/expense.entity.ts:108:9
    */
   static create(input: CreateExpenseInput): CreateExpenseInput {
     // I1
-    if (!AMOUNT_REGEX.test(input.amountUsd)) {
+    if (false) {
       throw new ValidationError(
         'Amount must be a positive decimal with at most 2 dp',
killedBy: Expense.create() (unit — domain invariants) I1 rejects an amount that is not a positive 2-dp decimal
statusReason: Error: Expected Expense.create() to throw INVALID_AMOUNT, but it succeeded

[Killed] ConditionalExpression
modules/social/domain/expense.entity.ts:118:34
     }
     // I2
     const num = Number(input.amountUsd);
-    if (!Number.isFinite(num) || num <= 0 || num > MAX_AMOUNT) {
+    if (!Number.isFinite(num) || false || num > MAX_AMOUNT) {
       throw new ValidationError(
         'Amount out of range',
killedBy: Expense.create() (unit — domain invariants) I2 rejects an amount of zero or above the numeric(10,2) ceiling
statusReason: Error: Expected Expense.create() to throw INVALID_AMOUNT, but it succeeded

[Killed] EqualityOperator
modules/social/domain/expense.entity.ts:118:46
     }
     // I2
     const num = Number(input.amountUsd);
-    if (!Number.isFinite(num) || num <= 0 || num > MAX_AMOUNT) {
+    if (!Number.isFinite(num) || num <= 0 || num <= MAX_AMOUNT) {
       throw new ValidationError(
         'Amount out of range',
killedBy: Expense.create() (unit — domain invariants) happy path returns the input, with currency uppercased
statusReason: ValidationError: Amount out of range

[Killed] MethodExpression
modules/social/domain/expense.entity.ts:127:22
       );
     }
     // I3 (uppercase first so the caller doesn't have to)
-    const currency = input.currency.toUpperCase();
+    const currency = input.currency.toLowerCase();
     if (!CURRENCY_REGEX.test(currency)) {
       throw new ValidationError(
killedBy: Expense.create() (unit — domain invariants) happy path returns the input, with currency uppercased
statusReason: ValidationError: Currency must be ISO 4217 (3 letters)

[Killed] ConditionalExpression
modules/social/domain/expense.entity.ts:128:9
     }
     // I3 (uppercase first so the caller doesn't have to)
     const currency = input.currency.toUpperCase();
-    if (!CURRENCY_REGEX.test(currency)) {
+    if (false) {
       throw new ValidationError(
         'Currency must be ISO 4217 (3 letters)',
killedBy: Expense.create() (unit — domain invariants) I3 rejects a currency that is not 3 letters
statusReason: Error: Expected Expense.create() to throw INVALID_CURRENCY, but it succeeded

[Killed] BooleanLiteral
modules/social/domain/expense.entity.ts:128:9
     }
     // I3 (uppercase first so the caller doesn't have to)
     const currency = input.currency.toUpperCase();
-    if (!CURRENCY_REGEX.test(currency)) {
+    if (CURRENCY_REGEX.test(currency)) {
       throw new ValidationError(
         'Currency must be ISO 4217 (3 letters)',
killedBy: Expense.create() (unit — domain invariants) happy path returns the input, with currency uppercased
statusReason: ValidationError: Currency must be ISO 4217 (3 letters)

[Killed] EqualityOperator
modules/social/domain/expense.entity.ts:138:9
     }
     // I4
     const entries = Object.entries(input.splitShare);
-    if (entries.length === 0) {
+    if (entries.length !== 0) {
       throw new ValidationError(
         'splitShare must have at least one participant',
killedBy: Expense.create() (unit — domain invariants) happy path returns the input, with currency uppercased
statusReason: ValidationError: splitShare must have at least one participant

[Killed] ConditionalExpression
modules/social/domain/expense.entity.ts:138:9
     }
     // I4
     const entries = Object.entries(input.splitShare);
-    if (entries.length === 0) {
+    if (true) {
       throw new ValidationError(
         'splitShare must have at least one participant',
killedBy: Expense.create() (unit — domain invariants) happy path returns the input, with currency uppercased
statusReason: ValidationError: splitShare must have at least one participant

[Survived] ArrayDeclaration
modules/social/domain/expense.entity.ts:141:23
     if (entries.length === 0) {
       throw new ValidationError(
         'splitShare must have at least one participant',
-        { splitShare: ['must be non-empty'] },
+        { splitShare: [] },
         {},
         'INVALID_SPLIT',

[Killed] BlockStatement
modules/social/domain/expense.entity.ts:147:44
       );
     }
     let sum = 0;
-    for (const [userId, share] of entries) {
-      // I5 (key + value)
-      if (typeof userId !== 'string' || userId.length === 0) {
-        throw new ValidationError(
-          'splitShare keys must be non-empty strings',
-          { splitShare: ['key malformed'] },
-          {},
-          'INVALID_SPLIT',
-        );
-      }
-      if (typeof share !== 'number' || !Number.isFinite(share) || share <= 0 || share > 1) {
-        throw new ValidationError(
-          `splitShare[${userId}] must be in (0, 1]`,
-          { splitShare: ['each share must be > 0 and ≤ 1'] },
-          { userId, share },
-          'INVALID_SPLIT',
-        );
-      }
-      sum += share;
-    }
+    for (const [userId, share] of entries) {}
     // I6
     if (Math.abs(sum - 1) > SHARE_SUM_TOLERANCE) {
killedBy: Expense.create() (unit — domain invariants) happy path returns the input, with currency uppercased
statusReason: ValidationError: splitShare must sum to 1.0 (got 0.0000)

[Killed] ConditionalExpression
modules/social/domain/expense.entity.ts:149:11
     let sum = 0;
     for (const [userId, share] of entries) {
       // I5 (key + value)
-      if (typeof userId !== 'string' || userId.length === 0) {
+      if (true) {
         throw new ValidationError(
           'splitShare keys must be non-empty strings',
killedBy: Expense.create() (unit — domain invariants) happy path returns the input, with currency uppercased
statusReason: ValidationError: splitShare keys must be non-empty strings

[Killed] EqualityOperator
modules/social/domain/expense.entity.ts:149:11
     let sum = 0;
     for (const [userId, share] of entries) {
       // I5 (key + value)
-      if (typeof userId !== 'string' || userId.length === 0) {
+      if (typeof userId === 'string' || userId.length === 0) {
         throw new ValidationError(
           'splitShare keys must be non-empty strings',
killedBy: Expense.create() (unit — domain invariants) happy path returns the input, with currency uppercased
statusReason: ValidationError: splitShare keys must be non-empty strings

[Killed] EqualityOperator
modules/social/domain/expense.entity.ts:157:67
           'INVALID_SPLIT',
         );
       }
-      if (typeof share !== 'number' || !Number.isFinite(share) || share <= 0 || share > 1) {
+      if (typeof share !== 'number' || !Number.isFinite(share) || share > 0 || share > 1) {
         throw new ValidationError(
           `splitShare[${userId}] must be in (0, 1]`,
killedBy: Expense.create() (unit — domain invariants) happy path returns the input, with currency uppercased
statusReason: ValidationError: splitShare[user_alice] must be in (0, 1]

[Killed] BooleanLiteral
modules/social/domain/expense.entity.ts:157:40
           'INVALID_SPLIT',
         );
       }
-      if (typeof share !== 'number' || !Number.isFinite(share) || share <= 0 || share > 1) {
+      if (typeof share !== 'number' || Number.isFinite(share) || share <= 0 || share > 1) {
         throw new ValidationError(
           `splitShare[${userId}] must be in (0, 1]`,
killedBy: Expense.create() (unit — domain invariants) happy path returns the input, with currency uppercased
statusReason: ValidationError: splitShare[user_alice] must be in (0, 1]

[Killed] AssignmentOperator
modules/social/domain/expense.entity.ts:165:7
           'INVALID_SPLIT',
         );
       }
-      sum += share;
+      sum -= share;
     }
     // I6
killedBy: Expense.create() (unit — domain invariants) happy path returns the input, with currency uppercased
statusReason: ValidationError: splitShare must sum to 1.0 (got -1.0000)

[Killed] ConditionalExpression
modules/social/domain/expense.entity.ts:168:9
       sum += share;
     }
     // I6
-    if (Math.abs(sum - 1) > SHARE_SUM_TOLERANCE) {
+    if (true) {
       throw new ValidationError(
         `splitShare must sum to 1.0 (got ${sum.toFixed(4)})`,
killedBy: Expense.create() (unit — domain invariants) happy path returns the input, with currency uppercased
statusReason: ValidationError: splitShare must sum to 1.0 (got 1.0000)

[Killed] EqualityOperator
modules/social/domain/expense.entity.ts:168:9
       sum += share;
     }
     // I6
-    if (Math.abs(sum - 1) > SHARE_SUM_TOLERANCE) {
+    if (Math.abs(sum - 1) <= SHARE_SUM_TOLERANCE) {
       throw new ValidationError(
         `splitShare must sum to 1.0 (got ${sum.toFixed(4)})`,
killedBy: Expense.create() (unit — domain invariants) happy path returns the input, with currency uppercased
statusReason: ValidationError: splitShare must sum to 1.0 (got 1.0000)

[Killed] ConditionalExpression
modules/social/domain/expense.entity.ts:177:9
       );
     }
     // I7
-    if (input.splitShare[input.paidById] === undefined) {
+    if (true) {
       throw new ValidationError(
         'Payer must appear in splitShare',
killedBy: Expense.create() (unit — domain invariants) happy path returns the input, with currency uppercased
statusReason: ValidationError: Payer must appear in splitShare

[Killed] BlockStatement
modules/social/domain/expense.entity.ts:177:57
       );
     }
     // I7
-    if (input.splitShare[input.paidById] === undefined) {
-      throw new ValidationError(
-        'Payer must appear in splitShare',
-        { splitShare: ['must include the payer'] },
-        { payerId: input.paidById },
-        'INVALID_SPLIT',
-      );
-    }
+    if (input.splitShare[input.paidById] === undefined) {}
     return { ...input, currency };
   }
killedBy: Expense.create() (unit — domain invariants) I7 rejects a splitShare that does not include the payer
statusReason: Error: Expected Expense.create() to throw INVALID_SPLIT, but it succeeded

[Killed] BlockStatement
modules/social/domain/expense.entity.ts:194:63
    * passed through `Expense.create()` on the way in), so no
    * validation runs here.
    */
-  static fromPersistence(row: ExpensePersistenceRow): Expense {
-    return new Expense(row);
-  }
+  static fromPersistence(row: ExpensePersistenceRow): Expense {}
 }
 
killedBy: Expense.fromPersistence() (unit) round-trips a DB row into a class instance with readable fields
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Expense

Received value has no prototype
Received value: undefined
