[Killed] BlockStatement
modules/account/domain/trusted-contact.entity.ts:55:58
   readonly createdAt: Date;
   readonly updatedAt: Date;
 
-  private constructor(row: TrustedContactPersistenceRow) {
-    this.id = row.id;
-    this.userId = row.userId;
-    this.name = row.name;
-    this.phone = row.phone;
-    this.email = row.email;
-    this.createdAt = row.createdAt;
-    this.updatedAt = row.updatedAt;
-  }
+  private constructor(row: TrustedContactPersistenceRow) {}
 
   /**
killedBy: TrustedContact.fromPersistence() (unit) round-trips a DB row into a class instance
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Alice Mom"
Received: undefined

[Killed] ConditionalExpression
modules/account/domain/trusted-contact.entity.ts:77:9
    *   C5 email (when set) ≤ TRUSTED_CONTACT_MAX_EMAIL_CHARS + contains @
    */
   static create(input: CreateTrustedContactInput): CreateTrustedContactInput {
-    if (typeof input.userId !== 'string' || input.userId.length === 0) {
+    if (true) {
       throw new ValidationError(
         'userId must be a non-empty string',
killedBy: TrustedContact.create() (unit — domain invariants) happy path returns trimmed name + non-null channels
statusReason: ValidationError: userId must be a non-empty string

[Killed] ConditionalExpression
modules/account/domain/trusted-contact.entity.ts:77:45
    *   C5 email (when set) ≤ TRUSTED_CONTACT_MAX_EMAIL_CHARS + contains @
    */
   static create(input: CreateTrustedContactInput): CreateTrustedContactInput {
-    if (typeof input.userId !== 'string' || input.userId.length === 0) {
+    if (typeof input.userId !== 'string' || false) {
       throw new ValidationError(
         'userId must be a non-empty string',
killedBy: TrustedContact.create() (unit — domain invariants) C1 rejects empty userId
statusReason: Error: Expected TrustedContact.create() to throw INVALID_TRUSTED_CONTACT, but it succeeded

[Killed] MethodExpression
modules/account/domain/trusted-contact.entity.ts:85:18
         'INVALID_TRUSTED_CONTACT',
       );
     }
-    const name = input.name.trim();
+    const name = input.name;
     if (name.length === 0 || name.length > TRUSTED_CONTACT_MAX_NAME_CHARS) {
       throw new ValidationError(
killedBy: TrustedContact.create() (unit — domain invariants) happy path returns trimmed name + non-null channels
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "email": "mom@example.com",
-   "name": "Alice Mom",

[Killed] EqualityOperator
modules/account/domain/trusted-contact.entity.ts:86:30
       );
     }
     const name = input.name.trim();
-    if (name.length === 0 || name.length > TRUSTED_CONTACT_MAX_NAME_CHARS) {
+    if (name.length === 0 || name.length <= TRUSTED_CONTACT_MAX_NAME_CHARS) {
       throw new ValidationError(
         `name must be 1..${TRUSTED_CONTACT_MAX_NAME_CHARS} chars (after trim)`,
killedBy: TrustedContact.create() (unit — domain invariants) happy path returns trimmed name + non-null channels
statusReason: ValidationError: name must be 1..120 chars (after trim)

[Killed] EqualityOperator
modules/account/domain/trusted-contact.entity.ts:86:9
       );
     }
     const name = input.name.trim();
-    if (name.length === 0 || name.length > TRUSTED_CONTACT_MAX_NAME_CHARS) {
+    if (name.length !== 0 || name.length > TRUSTED_CONTACT_MAX_NAME_CHARS) {
       throw new ValidationError(
         `name must be 1..${TRUSTED_CONTACT_MAX_NAME_CHARS} chars (after trim)`,
killedBy: TrustedContact.create() (unit — domain invariants) happy path returns trimmed name + non-null channels
statusReason: ValidationError: name must be 1..120 chars (after trim)

[Survived] ArrayDeclaration
modules/account/domain/trusted-contact.entity.ts:89:17
     if (name.length === 0 || name.length > TRUSTED_CONTACT_MAX_NAME_CHARS) {
       throw new ValidationError(
         `name must be 1..${TRUSTED_CONTACT_MAX_NAME_CHARS} chars (after trim)`,
-        { name: ['out of range'] },
+        { name: [] },
         { length: name.length },
         'INVALID_TRUSTED_CONTACT',

[Killed] ConditionalExpression
modules/account/domain/trusted-contact.entity.ts:94:19
         'INVALID_TRUSTED_CONTACT',
       );
     }
-    const phone = input.phone && input.phone.trim().length > 0 ? input.phone.trim() : null;
+    const phone = false ? input.phone.trim() : null;
     const email = input.email && input.email.trim().length > 0 ? input.email.trim() : null;
     if (!phone && !email) {
killedBy: TrustedContact.create() (unit — domain invariants) happy path returns trimmed name + non-null channels
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "email": "mom@example.com",
    "name": "Alice Mom",

[Killed] LogicalOperator
modules/account/domain/trusted-contact.entity.ts:94:19
         'INVALID_TRUSTED_CONTACT',
       );
     }
-    const phone = input.phone && input.phone.trim().length > 0 ? input.phone.trim() : null;
+    const phone = input.phone || input.phone.trim().length > 0 ? input.phone.trim() : null;
     const email = input.email && input.email.trim().length > 0 ? input.email.trim() : null;
     if (!phone && !email) {
killedBy: TrustedContact.create() (unit — domain invariants) email-only is OK
statusReason: TypeError: Cannot read properties of null (reading 'trim')

[Killed] ConditionalExpression
modules/account/domain/trusted-contact.entity.ts:95:19
       );
     }
     const phone = input.phone && input.phone.trim().length > 0 ? input.phone.trim() : null;
-    const email = input.email && input.email.trim().length > 0 ? input.email.trim() : null;
+    const email = true ? input.email.trim() : null;
     if (!phone && !email) {
       throw new ValidationError(
killedBy: TrustedContact.create() (unit — domain invariants) phone-only is OK
statusReason: TypeError: Cannot read properties of null (reading 'trim')

[Killed] EqualityOperator
modules/account/domain/trusted-contact.entity.ts:95:34
       );
     }
     const phone = input.phone && input.phone.trim().length > 0 ? input.phone.trim() : null;
-    const email = input.email && input.email.trim().length > 0 ? input.email.trim() : null;
+    const email = input.email && input.email.trim().length <= 0 ? input.email.trim() : null;
     if (!phone && !email) {
       throw new ValidationError(
killedBy: TrustedContact.create() (unit — domain invariants) happy path returns trimmed name + non-null channels
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "email": "mom@example.com",
+   "email": null,

[Killed] ConditionalExpression
modules/account/domain/trusted-contact.entity.ts:96:9
     }
     const phone = input.phone && input.phone.trim().length > 0 ? input.phone.trim() : null;
     const email = input.email && input.email.trim().length > 0 ? input.email.trim() : null;
-    if (!phone && !email) {
+    if (true) {
       throw new ValidationError(
         'A trusted contact needs at least a phone or an email',
killedBy: TrustedContact.create() (unit — domain invariants) happy path returns trimmed name + non-null channels
statusReason: ValidationError: A trusted contact needs at least a phone or an email

[Killed] BlockStatement
modules/account/domain/trusted-contact.entity.ts:96:27
     }
     const phone = input.phone && input.phone.trim().length > 0 ? input.phone.trim() : null;
     const email = input.email && input.email.trim().length > 0 ? input.email.trim() : null;
-    if (!phone && !email) {
-      throw new ValidationError(
-        'A trusted contact needs at least a phone or an email',
-        { phone: ['or email is required'], email: ['or phone is required'] },
-        {},
-        'CONTACT_CHANNEL_REQUIRED',
-      );
-    }
+    if (!phone && !email) {}
     if (phone && phone.length > TRUSTED_CONTACT_MAX_PHONE_CHARS) {
       throw new ValidationError(
killedBy: TrustedContact.create() (unit — domain invariants) C3 rejects channel-empty (no phone + no email)
statusReason: Error: Expected TrustedContact.create() to throw CONTACT_CHANNEL_REQUIRED, but it succeeded

[Survived] ArrayDeclaration
modules/account/domain/trusted-contact.entity.ts:99:51
     if (!phone && !email) {
       throw new ValidationError(
         'A trusted contact needs at least a phone or an email',
-        { phone: ['or email is required'], email: ['or phone is required'] },
+        { phone: ['or email is required'], email: [] },
         {},
         'CONTACT_CHANNEL_REQUIRED',

[Killed] ConditionalExpression
modules/account/domain/trusted-contact.entity.ts:104:18
         'CONTACT_CHANNEL_REQUIRED',
       );
     }
-    if (phone && phone.length > TRUSTED_CONTACT_MAX_PHONE_CHARS) {
+    if (phone && true) {
       throw new ValidationError(
         `phone must be ≤ ${TRUSTED_CONTACT_MAX_PHONE_CHARS} chars`,
killedBy: TrustedContact.create() (unit — domain invariants) happy path returns trimmed name + non-null channels
statusReason: ValidationError: phone must be ≤ 32 chars

[Killed] ConditionalExpression
modules/account/domain/trusted-contact.entity.ts:104:9
         'CONTACT_CHANNEL_REQUIRED',
       );
     }
-    if (phone && phone.length > TRUSTED_CONTACT_MAX_PHONE_CHARS) {
+    if (false) {
       throw new ValidationError(
         `phone must be ≤ ${TRUSTED_CONTACT_MAX_PHONE_CHARS} chars`,
killedBy: TrustedContact.create() (unit — domain invariants) C4 rejects a phone > 32 chars
statusReason: Error: Expected TrustedContact.create() to throw INVALID_TRUSTED_CONTACT, but it succeeded

[Survived] ArrayDeclaration
modules/account/domain/trusted-contact.entity.ts:107:18
     if (phone && phone.length > TRUSTED_CONTACT_MAX_PHONE_CHARS) {
       throw new ValidationError(
         `phone must be ≤ ${TRUSTED_CONTACT_MAX_PHONE_CHARS} chars`,
-        { phone: ['too long'] },
+        { phone: [] },
         { length: phone.length },
         'INVALID_TRUSTED_CONTACT',

[Killed] ConditionalExpression
modules/account/domain/trusted-contact.entity.ts:112:19
         'INVALID_TRUSTED_CONTACT',
       );
     }
-    if (email && (email.length > TRUSTED_CONTACT_MAX_EMAIL_CHARS || !email.includes('@'))) {
+    if (email && (false || !email.includes('@'))) {
       throw new ValidationError(
         'email is malformed or too long',
killedBy: TrustedContact.create() (unit — domain invariants) C5 rejects a malformed / overlong email
statusReason: Error: Expected TrustedContact.create() to throw INVALID_TRUSTED_CONTACT, but it succeeded

[Killed] LogicalOperator
modules/account/domain/trusted-contact.entity.ts:112:9
         'INVALID_TRUSTED_CONTACT',
       );
     }
-    if (email && (email.length > TRUSTED_CONTACT_MAX_EMAIL_CHARS || !email.includes('@'))) {
+    if (email || email.length > TRUSTED_CONTACT_MAX_EMAIL_CHARS || !email.includes('@')) {
       throw new ValidationError(
         'email is malformed or too long',
killedBy: TrustedContact.create() (unit — domain invariants) happy path returns trimmed name + non-null channels
statusReason: ValidationError: email is malformed or too long

[Killed] BlockStatement
modules/account/domain/trusted-contact.entity.ts:124:77
   }
 
   /** Wrap a persisted row in a `TrustedContact` instance. */
-  static fromPersistence(row: TrustedContactPersistenceRow): TrustedContact {
-    return new TrustedContact(row);
-  }
+  static fromPersistence(row: TrustedContactPersistenceRow): TrustedContact {}
 }
 
killedBy: TrustedContact.fromPersistence() (unit) round-trips a DB row into a class instance
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: TrustedContact

Received value has no prototype
Received value: undefined
