[Killed] BlockStatement
modules/diary/domain/diary-entry.entity.ts:74:54
   readonly createdAt: Date;
   readonly updatedAt: Date;
 
-  private constructor(row: DiaryEntryPersistenceRow) {
-    this.id = row.id;
-    this.userId = row.userId;
-    this.tripId = row.tripId;
-    this.title = row.title;
-    this.body = row.body;
-    this.mood = row.mood;
-    this.aiAssisted = row.aiAssisted;
-    this.entryDate = row.entryDate;
-    this.createdAt = row.createdAt;
-    this.updatedAt = row.updatedAt;
-  }
+  private constructor(row: DiaryEntryPersistenceRow) {}
 
   /**
killedBy: DiaryEntry.fromPersistence() (unit) round-trips a DB row into a class instance
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] MethodExpression
modules/diary/domain/diary-entry.entity.ts:97:19
    *   D4 entryDate parses to a valid Date (or defaults to now)
    */
   static create(input: CreateDiaryEntryInput): NormalisedDiaryEntry {
-    const title = input.title.trim();
+    const title = input.title;
     if (title.length === 0 || title.length > DIARY_MAX_TITLE) {
       throw new ValidationError(
killedBy: DiaryEntry.create() (unit — domain invariants) happy path normalises title/body, defaults aiAssisted=false, parses entryDate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Day 1"
Received: "  Day 1  "

[Killed] LogicalOperator
modules/diary/domain/diary-entry.entity.ts:98:9
    */
   static create(input: CreateDiaryEntryInput): NormalisedDiaryEntry {
     const title = input.title.trim();
-    if (title.length === 0 || title.length > DIARY_MAX_TITLE) {
+    if (title.length === 0 && title.length > DIARY_MAX_TITLE) {
       throw new ValidationError(
         `Title must be 1–${DIARY_MAX_TITLE} characters`,
killedBy: DiaryEntry.create() (unit — domain invariants) D1 rejects empty / overlong title
statusReason: Error: Expected DiaryEntry.create() to throw INVALID_DIARY_TITLE, but it succeeded

[Killed] ConditionalExpression
modules/diary/domain/diary-entry.entity.ts:98:31
    */
   static create(input: CreateDiaryEntryInput): NormalisedDiaryEntry {
     const title = input.title.trim();
-    if (title.length === 0 || title.length > DIARY_MAX_TITLE) {
+    if (title.length === 0 || false) {
       throw new ValidationError(
         `Title must be 1–${DIARY_MAX_TITLE} characters`,
killedBy: DiaryEntry.create() (unit — domain invariants) D1 rejects empty / overlong title
statusReason: Error: Expected DiaryEntry.create() to throw INVALID_DIARY_TITLE, but it succeeded

[Survived] ArrayDeclaration
modules/diary/domain/diary-entry.entity.ts:101:18
     if (title.length === 0 || title.length > DIARY_MAX_TITLE) {
       throw new ValidationError(
         `Title must be 1–${DIARY_MAX_TITLE} characters`,
-        { title: [`1–${DIARY_MAX_TITLE} characters`] },
+        { title: [] },
         { length: title.length },
         'INVALID_DIARY_TITLE',

[Killed] MethodExpression
modules/diary/domain/diary-entry.entity.ts:106:18
         'INVALID_DIARY_TITLE',
       );
     }
-    const body = input.body.trim();
+    const body = input.body;
     if (body.length === 0 || body.length > DIARY_MAX_BODY) {
       throw new ValidationError(
killedBy: DiaryEntry.create() (unit — domain invariants) happy path normalises title/body, defaults aiAssisted=false, parses entryDate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "text"
Received: "  text  "

[Killed] BlockStatement
modules/diary/domain/diary-entry.entity.ts:107:60
       );
     }
     const body = input.body.trim();
-    if (body.length === 0 || body.length > DIARY_MAX_BODY) {
-      throw new ValidationError(
-        `Body must be 1–${DIARY_MAX_BODY} characters`,
-        { body: [`1–${DIARY_MAX_BODY} characters`] },
-        { length: body.length },
-        'INVALID_DIARY_BODY',
-      );
-    }
+    if (body.length === 0 || body.length > DIARY_MAX_BODY) {}
     const mood = input.mood?.trim() || null;
     if (mood && mood.length > DIARY_MAX_MOOD) {
killedBy: DiaryEntry.create() (unit — domain invariants) D2 rejects empty / overlong body
statusReason: Error: Expected DiaryEntry.create() to throw INVALID_DIARY_BODY, but it succeeded

[Killed] ConditionalExpression
modules/diary/domain/diary-entry.entity.ts:107:9
       );
     }
     const body = input.body.trim();
-    if (body.length === 0 || body.length > DIARY_MAX_BODY) {
+    if (true) {
       throw new ValidationError(
         `Body must be 1–${DIARY_MAX_BODY} characters`,
killedBy: DiaryEntry.create() (unit — domain invariants) happy path normalises title/body, defaults aiAssisted=false, parses entryDate
statusReason: ValidationError: Body must be 1–20000 characters

[Killed] MethodExpression
modules/diary/domain/diary-entry.entity.ts:115:18
         'INVALID_DIARY_BODY',
       );
     }
-    const mood = input.mood?.trim() || null;
+    const mood = input.mood || null;
     if (mood && mood.length > DIARY_MAX_MOOD) {
       throw new ValidationError(
killedBy: DiaryEntry.create() (unit — domain invariants) empty/whitespace mood collapses to null
statusReason: Error: expect(received).toBeNull()

Received: "   "

[Killed] LogicalOperator
modules/diary/domain/diary-entry.entity.ts:115:18
         'INVALID_DIARY_BODY',
       );
     }
-    const mood = input.mood?.trim() || null;
+    const mood = input.mood?.trim() && null;
     if (mood && mood.length > DIARY_MAX_MOOD) {
       throw new ValidationError(
killedBy: DiaryEntry.create() (unit — domain invariants) empty/whitespace mood collapses to null
statusReason: Error: expect(received).toBeNull()

Received: ""

[Killed] ConditionalExpression
modules/diary/domain/diary-entry.entity.ts:116:9
       );
     }
     const mood = input.mood?.trim() || null;
-    if (mood && mood.length > DIARY_MAX_MOOD) {
+    if (false) {
       throw new ValidationError(
         'Mood too long',
killedBy: DiaryEntry.create() (unit — domain invariants) D3 rejects mood > 40 chars
statusReason: Error: Expected DiaryEntry.create() to throw INVALID_DIARY_MOOD, but it succeeded

[Killed] BlockStatement
modules/diary/domain/diary-entry.entity.ts:116:47
       );
     }
     const mood = input.mood?.trim() || null;
-    if (mood && mood.length > DIARY_MAX_MOOD) {
-      throw new ValidationError(
-        'Mood too long',
-        { mood: [`at most ${DIARY_MAX_MOOD} characters`] },
-        { length: mood.length },
-        'INVALID_DIARY_MOOD',
-      );
-    }
+    if (mood && mood.length > DIARY_MAX_MOOD) {}
     const entryDate = input.entryDate ? new Date(input.entryDate) : new Date();
     if (Number.isNaN(entryDate.getTime())) {
killedBy: DiaryEntry.create() (unit — domain invariants) D3 rejects mood > 40 chars
statusReason: Error: Expected DiaryEntry.create() to throw INVALID_DIARY_MOOD, but it succeeded

[Killed] ConditionalExpression
modules/diary/domain/diary-entry.entity.ts:125:9
       );
     }
     const entryDate = input.entryDate ? new Date(input.entryDate) : new Date();
-    if (Number.isNaN(entryDate.getTime())) {
+    if (false) {
       throw new ValidationError(
         'entryDate is not a valid date',
killedBy: DiaryEntry.create() (unit — domain invariants) D4 rejects an unparseable entryDate
statusReason: Error: Expected DiaryEntry.create() to throw INVALID_DIARY_DATE, but it succeeded

[Killed] ConditionalExpression
modules/diary/domain/diary-entry.entity.ts:125:9
       );
     }
     const entryDate = input.entryDate ? new Date(input.entryDate) : new Date();
-    if (Number.isNaN(entryDate.getTime())) {
+    if (true) {
       throw new ValidationError(
         'entryDate is not a valid date',
killedBy: DiaryEntry.create() (unit — domain invariants) happy path normalises title/body, defaults aiAssisted=false, parses entryDate
statusReason: ValidationError: entryDate is not a valid date

[Killed] LogicalOperator
modules/diary/domain/diary-entry.entity.ts:135:15
     }
     return {
       userId: input.userId,
-      tripId: input.tripId ?? null,
+      tripId: input.tripId && null,
       title,
       body,
killedBy: DiaryEntry.create() (unit — domain invariants) happy path normalises title/body, defaults aiAssisted=false, parses entryDate
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] ConditionalExpression
modules/diary/domain/diary-entry.entity.ts:139:19
       title,
       body,
       mood,
-      aiAssisted: input.aiAssisted === true,
+      aiAssisted: true,
       entryDate,
     };
killedBy: DiaryEntry.create() (unit — domain invariants) happy path normalises title/body, defaults aiAssisted=false, parses entryDate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
modules/diary/domain/diary-entry.entity.ts:139:19
       title,
       body,
       mood,
-      aiAssisted: input.aiAssisted === true,
+      aiAssisted: input.aiAssisted !== true,
       entryDate,
     };
killedBy: DiaryEntry.create() (unit — domain invariants) happy path normalises title/body, defaults aiAssisted=false, parses entryDate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
modules/diary/domain/diary-entry.entity.ts:145:69
   }
 
   /** Wrap a persisted row in a `DiaryEntry` instance. */
-  static fromPersistence(row: DiaryEntryPersistenceRow): DiaryEntry {
-    return new DiaryEntry(row);
-  }
+  static fromPersistence(row: DiaryEntryPersistenceRow): DiaryEntry {}
 }
 
killedBy: DiaryEntry.fromPersistence() (unit) round-trips a DB row into a class instance
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: DiaryEntry

Received value has no prototype
Received value: undefined
