[Survived] ArrayDeclaration
modules/media/domain/media-asset.entity.ts:31:55
 export const MEDIA_KINDS: readonly MediaKind[] = ['image', 'video'];
 
 export type MediaStatus = 'processing' | 'ready' | 'failed';
-export const MEDIA_STATUSES: readonly MediaStatus[] = ['processing', 'ready', 'failed'];
+export const MEDIA_STATUSES: readonly MediaStatus[] = [];
 
 export const MEDIA_MAX_CAPTION_CHARS = 280;

[Killed] BlockStatement
modules/media/domain/media-asset.entity.ts:92:54
   readonly variants: readonly MediaAssetVariant[] | null;
   readonly createdAt: Date;
 
-  private constructor(row: MediaAssetPersistenceRow) {
-    this.id = row.id;
-    this.ownerId = row.ownerId;
-    this.tripId = row.tripId;
-    this.memoryBookId = row.memoryBookId;
-    this.kind = row.kind;
-    this.status = row.status;
-    this.s3KeyRaw = row.s3KeyRaw;
-    this.exifStripped = row.exifStripped;
-    this.caption = row.caption;
-    this.position = row.position;
-    this.variants = row.variants;
-    this.createdAt = row.createdAt;
-  }
+  private constructor(row: MediaAssetPersistenceRow) {}
 
   /** Validate + return a normalised CreateMediaAssetInput ready for
killedBy: MediaAsset.assertCanMarkReady() passes for processing
statusReason: Error: expect(received).not.toThrow()

Error name:    "ConflictError"
Error message: "Media asset cannot transition to ready from status \"undefined\""

      225 |         } else {
      226 |           stryCov_9fa48("227");
    > 227 |           throw new ConflictError(`Media asset cannot transition to ready from status "${asset.status}"`, {

[Killed] ConditionalExpression
modules/media/domain/media-asset.entity.ts:110:9
   /** Validate + return a normalised CreateMediaAssetInput ready for
    *  `MediaAssetRepository.create()`. */
   static create(input: CreateMediaAssetInput): CreateMediaAssetInput {
-    if (typeof input.ownerId !== 'string' || input.ownerId.length === 0) {
+    if (true) {
       throw new ValidationError(
         'ownerId must be a non-empty string',
killedBy: MediaAsset.create() (unit — domain invariants) happy path returns the input untouched
statusReason: ValidationError: ownerId must be a non-empty string

[Killed] EqualityOperator
modules/media/domain/media-asset.entity.ts:110:46
   /** Validate + return a normalised CreateMediaAssetInput ready for
    *  `MediaAssetRepository.create()`. */
   static create(input: CreateMediaAssetInput): CreateMediaAssetInput {
-    if (typeof input.ownerId !== 'string' || input.ownerId.length === 0) {
+    if (typeof input.ownerId !== 'string' || input.ownerId.length !== 0) {
       throw new ValidationError(
         'ownerId must be a non-empty string',
killedBy: MediaAsset.create() (unit — domain invariants) happy path returns the input untouched
statusReason: ValidationError: ownerId must be a non-empty string

[Killed] LogicalOperator
modules/media/domain/media-asset.entity.ts:118:9
         'INVALID_MEDIA_ASSET',
       );
     }
-    if (typeof input.s3KeyRaw !== 'string' || input.s3KeyRaw.length === 0) {
+    if (typeof input.s3KeyRaw !== 'string' && input.s3KeyRaw.length === 0) {
       throw new ValidationError(
         's3KeyRaw must be a non-empty string',
killedBy: MediaAsset.create() (unit — domain invariants) M1 rejects empty ownerId / s3KeyRaw
statusReason: Error: Expected MediaAsset.create() to throw INVALID_MEDIA_ASSET, but it succeeded

[Killed] EqualityOperator
modules/media/domain/media-asset.entity.ts:118:47
         'INVALID_MEDIA_ASSET',
       );
     }
-    if (typeof input.s3KeyRaw !== 'string' || input.s3KeyRaw.length === 0) {
+    if (typeof input.s3KeyRaw !== 'string' || input.s3KeyRaw.length !== 0) {
       throw new ValidationError(
         's3KeyRaw must be a non-empty string',
killedBy: MediaAsset.create() (unit — domain invariants) happy path returns the input untouched
statusReason: ValidationError: s3KeyRaw must be a non-empty string

[Survived] ArrayDeclaration
modules/media/domain/media-asset.entity.ts:121:21
     if (typeof input.s3KeyRaw !== 'string' || input.s3KeyRaw.length === 0) {
       throw new ValidationError(
         's3KeyRaw must be a non-empty string',
-        { s3KeyRaw: ['must be non-empty'] },
+        { s3KeyRaw: [] },
         {},
         'INVALID_MEDIA_ASSET',

[Killed] ConditionalExpression
modules/media/domain/media-asset.entity.ts:126:9
         'INVALID_MEDIA_ASSET',
       );
     }
-    if (!MEDIA_KINDS.includes(input.kind)) {
+    if (false) {
       throw new ValidationError(
         `kind must be one of ${MEDIA_KINDS.join(' | ')}`,
killedBy: MediaAsset.create() (unit — domain invariants) M2 rejects an unknown kind
statusReason: Error: Expected MediaAsset.create() to throw INVALID_MEDIA_ASSET, but it succeeded

[Killed] BooleanLiteral
modules/media/domain/media-asset.entity.ts:126:9
         'INVALID_MEDIA_ASSET',
       );
     }
-    if (!MEDIA_KINDS.includes(input.kind)) {
+    if (MEDIA_KINDS.includes(input.kind)) {
       throw new ValidationError(
         `kind must be one of ${MEDIA_KINDS.join(' | ')}`,
killedBy: MediaAsset.create() (unit — domain invariants) happy path returns the input untouched
statusReason: ValidationError: kind must be one of image | video

[Killed] BlockStatement
modules/media/domain/media-asset.entity.ts:141:76
    *  the field (returns null). Non-empty input is trimmed and capped
    *  at MEDIA_MAX_CAPTION_CHARS (cap by slice, not throw, to keep the
    *  UX forgiving — a 281-char caption shouldn't reject the save). */
-  static normaliseCaption(input: string | null | undefined): string | null {
-    if (input === null || input === undefined) return null;
-    const trimmed = input.trim();
-    if (trimmed.length === 0) return null;
-    return trimmed.slice(0, MEDIA_MAX_CAPTION_CHARS);
-  }
+  static normaliseCaption(input: string | null | undefined): string | null {}
 
   /** Status state machine — `processing` is the only legal source for
killedBy: MediaAsset.normaliseCaption() null / undefined / blank → null
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] ConditionalExpression
modules/media/domain/media-asset.entity.ts:142:27
    *  at MEDIA_MAX_CAPTION_CHARS (cap by slice, not throw, to keep the
    *  UX forgiving — a 281-char caption shouldn't reject the save). */
   static normaliseCaption(input: string | null | undefined): string | null {
-    if (input === null || input === undefined) return null;
+    if (input === null || false) return null;
     const trimmed = input.trim();
     if (trimmed.length === 0) return null;
killedBy: MediaAsset.normaliseCaption() null / undefined / blank → null
statusReason: TypeError: Cannot read properties of undefined (reading 'trim')

[Killed] EqualityOperator
modules/media/domain/media-asset.entity.ts:142:27
    *  at MEDIA_MAX_CAPTION_CHARS (cap by slice, not throw, to keep the
    *  UX forgiving — a 281-char caption shouldn't reject the save). */
   static normaliseCaption(input: string | null | undefined): string | null {
-    if (input === null || input === undefined) return null;
+    if (input === null || input !== undefined) return null;
     const trimmed = input.trim();
     if (trimmed.length === 0) return null;
killedBy: MediaAsset.normaliseCaption() null / undefined / blank → null
statusReason: TypeError: Cannot read properties of undefined (reading 'trim')

[Killed] MethodExpression
modules/media/domain/media-asset.entity.ts:143:21
    *  UX forgiving — a 281-char caption shouldn't reject the save). */
   static normaliseCaption(input: string | null | undefined): string | null {
     if (input === null || input === undefined) return null;
-    const trimmed = input.trim();
+    const trimmed = input;
     if (trimmed.length === 0) return null;
     return trimmed.slice(0, MEDIA_MAX_CAPTION_CHARS);
killedBy: MediaAsset.normaliseCaption() null / undefined / blank → null
statusReason: Error: expect(received).toBeNull()

Received: "   "

[Killed] ConditionalExpression
modules/media/domain/media-asset.entity.ts:144:9
   static normaliseCaption(input: string | null | undefined): string | null {
     if (input === null || input === undefined) return null;
     const trimmed = input.trim();
-    if (trimmed.length === 0) return null;
+    if (true) return null;
     return trimmed.slice(0, MEDIA_MAX_CAPTION_CHARS);
   }
killedBy: MediaAsset.normaliseCaption() trims and returns a non-empty value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hi"
Received: null

[Killed] EqualityOperator
modules/media/domain/media-asset.entity.ts:144:9
   static normaliseCaption(input: string | null | undefined): string | null {
     if (input === null || input === undefined) return null;
     const trimmed = input.trim();
-    if (trimmed.length === 0) return null;
+    if (trimmed.length !== 0) return null;
     return trimmed.slice(0, MEDIA_MAX_CAPTION_CHARS);
   }
killedBy: MediaAsset.normaliseCaption() null / undefined / blank → null
statusReason: Error: expect(received).toBeNull()

Received: ""

[Killed] MethodExpression
modules/media/domain/media-asset.entity.ts:145:12
     if (input === null || input === undefined) return null;
     const trimmed = input.trim();
     if (trimmed.length === 0) return null;
-    return trimmed.slice(0, MEDIA_MAX_CAPTION_CHARS);
+    return trimmed;
   }
 
killedBy: MediaAsset.normaliseCaption() caps at 280 chars by slice (forgiving)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 280
Received: 330

[Killed] BlockStatement
modules/media/domain/media-asset.entity.ts:152:54
    *  `markReady`. Throws `ConflictError(MEDIA_STATUS_LOCKED)` for any
    *  other current status so the repo can't silently flip a `failed`
    *  row back to `ready`. */
-  static assertCanMarkReady(asset: MediaAsset): void {
-    if (asset.status !== 'processing') {
-      throw new ConflictError(
-        `Media asset cannot transition to ready from status "${asset.status}"`,
-        { mediaId: asset.id, currentStatus: asset.status },
-        'MEDIA_STATUS_LOCKED',
-      );
-    }
-  }
+  static assertCanMarkReady(asset: MediaAsset): void {}
 
   /** Wrap a persisted row in a `MediaAsset` instance. */
killedBy: MediaAsset.assertCanMarkReady() throws MEDIA_STATUS_LOCKED for ready
statusReason: Error: expected to throw

[Killed] EqualityOperator
modules/media/domain/media-asset.entity.ts:153:9
    *  other current status so the repo can't silently flip a `failed`
    *  row back to `ready`. */
   static assertCanMarkReady(asset: MediaAsset): void {
-    if (asset.status !== 'processing') {
+    if (asset.status === 'processing') {
       throw new ConflictError(
         `Media asset cannot transition to ready from status "${asset.status}"`,
killedBy: MediaAsset.assertCanMarkReady() passes for processing
statusReason: Error: expect(received).not.toThrow()

Error name:    "ConflictError"
Error message: "Media asset cannot transition to ready from status \"processing\""

      225 |         } else {
      226 |           stryCov_9fa48("227");
    > 227 |           throw new ConflictError(`Media asset cannot transition to ready from status "${asset.status}"`, {

[Killed] ConditionalExpression
modules/media/domain/media-asset.entity.ts:153:9
    *  other current status so the repo can't silently flip a `failed`
    *  row back to `ready`. */
   static assertCanMarkReady(asset: MediaAsset): void {
-    if (asset.status !== 'processing') {
+    if (false) {
       throw new ConflictError(
         `Media asset cannot transition to ready from status "${asset.status}"`,
killedBy: MediaAsset.assertCanMarkReady() throws MEDIA_STATUS_LOCKED for ready
statusReason: Error: expected to throw

[Killed] BlockStatement
modules/media/domain/media-asset.entity.ts:163:69
   }
 
   /** Wrap a persisted row in a `MediaAsset` instance. */
-  static fromPersistence(row: MediaAssetPersistenceRow): MediaAsset {
-    return new MediaAsset(row);
-  }
+  static fromPersistence(row: MediaAssetPersistenceRow): MediaAsset {}
 }
 
killedBy: MediaAsset.assertCanMarkReady() passes for processing
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of undefined (reading 'status')"

      220 |     } else {
      221 |       stryCov_9fa48("222");
    > 222 |       if (stryMutAct_9fa48("225") ? asset.status === 'processing' : stryMutAct_9fa48("224") ? false : stryMutAct_9fa48("223") ? true : (stryCov_9fa48("223", "224", "225"), asset.status
