[Killed] BlockStatement
modules/safety/domain/agent-profile.entity.ts:89:56
   readonly createdAt: Date;
   readonly updatedAt: Date;
 
-  private constructor(row: AgentProfilePersistenceRow) {
-    this.id = row.id;
-    this.userId = row.userId;
-    this.displayName = row.displayName;
-    this.bio = row.bio;
-    this.kycStatus = row.kycStatus;
-    this.verifiedAt = row.verifiedAt;
-    this.languages = row.languages;
-    this.regions = row.regions;
-    this.ratingAverage = row.ratingAverage;
-    this.ratingCount = row.ratingCount;
-    this.createdAt = row.createdAt;
-    this.updatedAt = row.updatedAt;
-  }
+  private constructor(row: AgentProfilePersistenceRow) {}
 
   /**
killedBy: AgentProfile.fromPersistence() (unit) round-trips a DB row into a class instance
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "verified"
Received: undefined

[Killed] EqualityOperator
modules/safety/domain/agent-profile.entity.ts:120:9
       -readonly [K in keyof AgentProfileUpdatePatch]: AgentProfileUpdatePatch[K];
     } = {};
 
-    if (input.displayName !== undefined) {
+    if (input.displayName === undefined) {
       const trimmed = input.displayName.trim();
       if (trimmed.length === 0 || trimmed.length > AGENT_MAX_DISPLAY_CHARS) {
killedBy: AgentProfile.validateUpdate() (unit — domain invariants) empty input → empty patch (no field is "updated")
statusReason: TypeError: Cannot read properties of undefined (reading 'trim')

[Killed] BlockStatement
modules/safety/domain/agent-profile.entity.ts:120:42
       -readonly [K in keyof AgentProfileUpdatePatch]: AgentProfileUpdatePatch[K];
     } = {};
 
-    if (input.displayName !== undefined) {
-      const trimmed = input.displayName.trim();
-      if (trimmed.length === 0 || trimmed.length > AGENT_MAX_DISPLAY_CHARS) {
-        throw new ValidationError(
-          `displayName must be 1..${AGENT_MAX_DISPLAY_CHARS} chars`,
-          { displayName: ['out of range'] },
-          { length: trimmed.length },
-          'INVALID_AGENT_DISPLAY_NAME',
-        );
-      }
-      patch.displayName = trimmed;
-    }
+    if (input.displayName !== undefined) {}
 
     if (input.bio !== undefined) {
killedBy: AgentProfile.validateUpdate() (unit — domain invariants) happy path trims every present string field
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

@@ -1,8 +1,7 @@
  Object {
    "bio": "hi",

[Killed] MethodExpression
modules/safety/domain/agent-profile.entity.ts:121:23
     } = {};
 
     if (input.displayName !== undefined) {
-      const trimmed = input.displayName.trim();
+      const trimmed = input.displayName;
       if (trimmed.length === 0 || trimmed.length > AGENT_MAX_DISPLAY_CHARS) {
         throw new ValidationError(
killedBy: AgentProfile.validateUpdate() (unit — domain invariants) happy path trims every present string field
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
  Object {
    "bio": "hi",

[Killed] BlockStatement
modules/safety/domain/agent-profile.entity.ts:122:77
 
     if (input.displayName !== undefined) {
       const trimmed = input.displayName.trim();
-      if (trimmed.length === 0 || trimmed.length > AGENT_MAX_DISPLAY_CHARS) {
-        throw new ValidationError(
-          `displayName must be 1..${AGENT_MAX_DISPLAY_CHARS} chars`,
-          { displayName: ['out of range'] },
-          { length: trimmed.length },
-          'INVALID_AGENT_DISPLAY_NAME',
-        );
-      }
+      if (trimmed.length === 0 || trimmed.length > AGENT_MAX_DISPLAY_CHARS) {}
       patch.displayName = trimmed;
     }
killedBy: AgentProfile.validateUpdate() (unit — domain invariants) A1 rejects an empty / overlong displayName
statusReason: Error: Expected AgentProfile.validateUpdate() to throw INVALID_AGENT_DISPLAY_NAME, but it succeeded

[Killed] LogicalOperator
modules/safety/domain/agent-profile.entity.ts:122:11
 
     if (input.displayName !== undefined) {
       const trimmed = input.displayName.trim();
-      if (trimmed.length === 0 || trimmed.length > AGENT_MAX_DISPLAY_CHARS) {
+      if (trimmed.length === 0 && trimmed.length > AGENT_MAX_DISPLAY_CHARS) {
         throw new ValidationError(
           `displayName must be 1..${AGENT_MAX_DISPLAY_CHARS} chars`,
killedBy: AgentProfile.validateUpdate() (unit — domain invariants) A1 rejects an empty / overlong displayName
statusReason: Error: Expected AgentProfile.validateUpdate() to throw INVALID_AGENT_DISPLAY_NAME, but it succeeded

[Killed] EqualityOperator
modules/safety/domain/agent-profile.entity.ts:133:9
       patch.displayName = trimmed;
     }
 
-    if (input.bio !== undefined) {
+    if (input.bio === undefined) {
       if (input.bio === null) {
         patch.bio = null;
killedBy: AgentProfile.validateUpdate() (unit — domain invariants) empty input → empty patch (no field is "updated")
statusReason: TypeError: Cannot read properties of undefined (reading 'trim')

[Killed] BlockStatement
modules/safety/domain/agent-profile.entity.ts:133:34
       patch.displayName = trimmed;
     }
 
-    if (input.bio !== undefined) {
-      if (input.bio === null) {
-        patch.bio = null;
-      } else {
-        const trimmed = input.bio.trim();
-        if (trimmed.length > AGENT_MAX_BIO_CHARS) {
-          throw new ValidationError(
-            `bio must be ≤ ${AGENT_MAX_BIO_CHARS} chars`,
-            { bio: ['too long'] },
-            { length: trimmed.length },
-            'INVALID_AGENT_BIO',
-          );
-        }
-        patch.bio = trimmed;
-      }
-    }
+    if (input.bio !== undefined) {}
 
     for (const field of ['languages', 'regions'] as const) {
killedBy: AgentProfile.validateUpdate() (unit — domain invariants) happy path trims every present string field
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

@@ -1,7 +1,6 @@
  Object {
-   "bio": "hi",

[Killed] EqualityOperator
modules/safety/domain/agent-profile.entity.ts:134:11
     }
 
     if (input.bio !== undefined) {
-      if (input.bio === null) {
+      if (input.bio !== null) {
         patch.bio = null;
       } else {
killedBy: AgentProfile.validateUpdate() (unit — domain invariants) happy path trims every present string field
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "bio": "hi",

[Killed] BlockStatement
modules/safety/domain/agent-profile.entity.ts:134:31
     }
 
     if (input.bio !== undefined) {
-      if (input.bio === null) {
-        patch.bio = null;
-      } else {
+      if (input.bio === null) {} else {
         const trimmed = input.bio.trim();
         if (trimmed.length > AGENT_MAX_BIO_CHARS) {
killedBy: AgentProfile.validateUpdate() (unit — domain invariants) bio: null clears (passes through)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "bio": null,
- }

[Killed] BlockStatement
modules/safety/domain/agent-profile.entity.ts:136:14
     if (input.bio !== undefined) {
       if (input.bio === null) {
         patch.bio = null;
-      } else {
-        const trimmed = input.bio.trim();
-        if (trimmed.length > AGENT_MAX_BIO_CHARS) {
-          throw new ValidationError(
-            `bio must be ≤ ${AGENT_MAX_BIO_CHARS} chars`,
-            { bio: ['too long'] },
-            { length: trimmed.length },
-            'INVALID_AGENT_BIO',
-          );
-        }
-        patch.bio = trimmed;
-      }
+      } else {}
     }
 
killedBy: AgentProfile.validateUpdate() (unit — domain invariants) happy path trims every present string field
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

@@ -1,7 +1,6 @@
  Object {
-   "bio": "hi",

[Killed] MethodExpression
modules/safety/domain/agent-profile.entity.ts:137:25
       if (input.bio === null) {
         patch.bio = null;
       } else {
-        const trimmed = input.bio.trim();
+        const trimmed = input.bio;
         if (trimmed.length > AGENT_MAX_BIO_CHARS) {
           throw new ValidationError(
killedBy: AgentProfile.validateUpdate() (unit — domain invariants) happy path trims every present string field
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "bio": "hi",

[Killed] ConditionalExpression
modules/safety/domain/agent-profile.entity.ts:138:13
         patch.bio = null;
       } else {
         const trimmed = input.bio.trim();
-        if (trimmed.length > AGENT_MAX_BIO_CHARS) {
+        if (true) {
           throw new ValidationError(
             `bio must be ≤ ${AGENT_MAX_BIO_CHARS} chars`,
killedBy: AgentProfile.validateUpdate() (unit — domain invariants) happy path trims every present string field
statusReason: ValidationError: bio must be ≤ 2000 chars

[Killed] BlockStatement
modules/safety/domain/agent-profile.entity.ts:138:51
         patch.bio = null;
       } else {
         const trimmed = input.bio.trim();
-        if (trimmed.length > AGENT_MAX_BIO_CHARS) {
-          throw new ValidationError(
-            `bio must be ≤ ${AGENT_MAX_BIO_CHARS} chars`,
-            { bio: ['too long'] },
-            { length: trimmed.length },
-            'INVALID_AGENT_BIO',
-          );
-        }
+        if (trimmed.length > AGENT_MAX_BIO_CHARS) {}
         patch.bio = trimmed;
       }
killedBy: AgentProfile.validateUpdate() (unit — domain invariants) A2 rejects a bio longer than 2000 chars
statusReason: Error: Expected AgentProfile.validateUpdate() to throw INVALID_AGENT_BIO, but it succeeded

[Killed] EqualityOperator
modules/safety/domain/agent-profile.entity.ts:152:11
 
     for (const field of ['languages', 'regions'] as const) {
       const list = input[field];
-      if (list === undefined) continue;
+      if (list !== undefined) continue;
       if (list.length > AGENT_MAX_LIST) {
         throw new ValidationError(
killedBy: AgentProfile.validateUpdate() (unit — domain invariants) empty input → empty patch (no field is "updated")
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
modules/safety/domain/agent-profile.entity.ts:152:11
 
     for (const field of ['languages', 'regions'] as const) {
       const list = input[field];
-      if (list === undefined) continue;
+      if (false) continue;
       if (list.length > AGENT_MAX_LIST) {
         throw new ValidationError(
killedBy: AgentProfile.validateUpdate() (unit — domain invariants) empty input → empty patch (no field is "updated")
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
modules/safety/domain/agent-profile.entity.ts:153:11
     for (const field of ['languages', 'regions'] as const) {
       const list = input[field];
       if (list === undefined) continue;
-      if (list.length > AGENT_MAX_LIST) {
+      if (true) {
         throw new ValidationError(
           `${field} must have ≤ ${AGENT_MAX_LIST} entries`,
killedBy: AgentProfile.validateUpdate() (unit — domain invariants) happy path trims every present string field
statusReason: ValidationError: languages must have ≤ 20 entries

[Killed] ConditionalExpression
modules/safety/domain/agent-profile.entity.ts:153:11
     for (const field of ['languages', 'regions'] as const) {
       const list = input[field];
       if (list === undefined) continue;
-      if (list.length > AGENT_MAX_LIST) {
+      if (false) {
         throw new ValidationError(
           `${field} must have ≤ ${AGENT_MAX_LIST} entries`,
killedBy: AgentProfile.validateUpdate() (unit — domain invariants) A3 rejects > 20 languages
statusReason: Error: Expected AgentProfile.validateUpdate() to throw INVALID_AGENT_LIST, but it succeeded

[Killed] BlockStatement
modules/safety/domain/agent-profile.entity.ts:162:33
         );
       }
       const trimmed: string[] = [];
-      for (const entry of list) {
-        const t = entry.trim();
-        if (t.length < AGENT_MIN_ENTRY_CHARS || t.length > AGENT_MAX_ENTRY_CHARS) {
-          throw new ValidationError(
-            `each ${field} entry must be ${AGENT_MIN_ENTRY_CHARS}..${AGENT_MAX_ENTRY_CHARS} chars`,
-            { [field]: ['entry out of range'] },
-            { entry, length: t.length },
-            'INVALID_AGENT_LIST',
-          );
-        }
-        trimmed.push(t);
-      }
+      for (const entry of list) {}
       patch[field] = trimmed;
     }
killedBy: AgentProfile.validateUpdate() (unit — domain invariants) happy path trims every present string field
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 2

  Object {
    "bio": "hi",
    "displayName": "Alice",

[Killed] MethodExpression
modules/safety/domain/agent-profile.entity.ts:163:19
       }
       const trimmed: string[] = [];
       for (const entry of list) {
-        const t = entry.trim();
+        const t = entry;
         if (t.length < AGENT_MIN_ENTRY_CHARS || t.length > AGENT_MAX_ENTRY_CHARS) {
           throw new ValidationError(
killedBy: AgentProfile.validateUpdate() (unit — domain invariants) happy path trims every present string field
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
    "bio": "hi",
    "displayName": "Alice",

[Killed] EqualityOperator
modules/safety/domain/agent-profile.entity.ts:164:13
       const trimmed: string[] = [];
       for (const entry of list) {
         const t = entry.trim();
-        if (t.length < AGENT_MIN_ENTRY_CHARS || t.length > AGENT_MAX_ENTRY_CHARS) {
+        if (t.length >= AGENT_MIN_ENTRY_CHARS || t.length > AGENT_MAX_ENTRY_CHARS) {
           throw new ValidationError(
             `each ${field} entry must be ${AGENT_MIN_ENTRY_CHARS}..${AGENT_MAX_ENTRY_CHARS} chars`,
killedBy: AgentProfile.validateUpdate() (unit — domain invariants) happy path trims every present string field
statusReason: ValidationError: each languages entry must be 2..40 chars

[Killed] ConditionalExpression
modules/safety/domain/agent-profile.entity.ts:164:49
       const trimmed: string[] = [];
       for (const entry of list) {
         const t = entry.trim();
-        if (t.length < AGENT_MIN_ENTRY_CHARS || t.length > AGENT_MAX_ENTRY_CHARS) {
+        if (t.length < AGENT_MIN_ENTRY_CHARS || false) {
           throw new ValidationError(
             `each ${field} entry must be ${AGENT_MIN_ENTRY_CHARS}..${AGENT_MAX_ENTRY_CHARS} chars`,
killedBy: AgentProfile.validateUpdate() (unit — domain invariants) A3 rejects an out-of-range language entry
statusReason: Error: Expected AgentProfile.validateUpdate() to throw INVALID_AGENT_LIST, but it succeeded

[Killed] BlockStatement
modules/safety/domain/agent-profile.entity.ts:181:73
   }
 
   /** Wrap a persisted row in an `AgentProfile` instance. */
-  static fromPersistence(row: AgentProfilePersistenceRow): AgentProfile {
-    return new AgentProfile(row);
-  }
+  static fromPersistence(row: AgentProfilePersistenceRow): AgentProfile {}
 }
 
killedBy: AgentProfile.fromPersistence() (unit) round-trips a DB row into a class instance
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: AgentProfile

Received value has no prototype
Received value: undefined
