[Killed] BlockStatement
modules/safety/domain/scam-report.entity.ts:72:54
   readonly createdAt: Date;
   readonly updatedAt: Date;
 
-  private constructor(row: ScamReportPersistenceRow) {
-    this.id = row.id;
-    this.reporterId = row.reporterId;
-    this.category = row.category;
-    this.severity = row.severity;
-    this.description = row.description;
-    this.evidenceUrls = row.evidenceUrls;
-    this.verified = row.verified;
-    this.createdAt = row.createdAt;
-    this.updatedAt = row.updatedAt;
-  }
+  private constructor(row: ScamReportPersistenceRow) {}
 
   /**
killedBy: ScamReport.fromPersistence() (unit) round-trips a DB row into a class instance
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "medium"
Received: undefined

[Killed] ConditionalExpression
modules/safety/domain/scam-report.entity.ts:90:9
    * invariant break.
    */
   static create(input: CreateScamReportInput): CreateScamReportInput {
-    if (typeof input.reporterId !== 'string' || input.reporterId.length === 0) {
+    if (false) {
       throw new ValidationError(
         'reporterId must be a non-empty string',
killedBy: ScamReport.create() (unit — domain invariants) S1 rejects empty reporterId
statusReason: Error: Expected ScamReport.create() to throw INVALID_SCAM_REPORT, but it succeeded

[Killed] EqualityOperator
modules/safety/domain/scam-report.entity.ts:90:49
    * invariant break.
    */
   static create(input: CreateScamReportInput): CreateScamReportInput {
-    if (typeof input.reporterId !== 'string' || input.reporterId.length === 0) {
+    if (typeof input.reporterId !== 'string' || input.reporterId.length !== 0) {
       throw new ValidationError(
         'reporterId must be a non-empty string',
killedBy: ScamReport.create() (unit — domain invariants) happy path returns the input with category/description trimmed
statusReason: ValidationError: reporterId must be a non-empty string

[Killed] MethodExpression
modules/safety/domain/scam-report.entity.ts:98:22
         'INVALID_SCAM_REPORT',
       );
     }
-    const category = input.category.trim();
+    const category = input.category;
     if (category.length === 0 || category.length > SCAM_MAX_CATEGORY_LENGTH) {
       throw new ValidationError(
killedBy: ScamReport.create() (unit — domain invariants) happy path returns the input with category/description trimmed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "taxi-overcharge"
Received: "  taxi-overcharge  "

[Killed] ConditionalExpression
modules/safety/domain/scam-report.entity.ts:99:9
       );
     }
     const category = input.category.trim();
-    if (category.length === 0 || category.length > SCAM_MAX_CATEGORY_LENGTH) {
+    if (true) {
       throw new ValidationError(
         `category must be 1..${SCAM_MAX_CATEGORY_LENGTH} chars (after trim)`,
killedBy: ScamReport.create() (unit — domain invariants) happy path returns the input with category/description trimmed
statusReason: ValidationError: category must be 1..60 chars (after trim)

[Killed] EqualityOperator
modules/safety/domain/scam-report.entity.ts:99:9
       );
     }
     const category = input.category.trim();
-    if (category.length === 0 || category.length > SCAM_MAX_CATEGORY_LENGTH) {
+    if (category.length !== 0 || category.length > SCAM_MAX_CATEGORY_LENGTH) {
       throw new ValidationError(
         `category must be 1..${SCAM_MAX_CATEGORY_LENGTH} chars (after trim)`,
killedBy: ScamReport.create() (unit — domain invariants) happy path returns the input with category/description trimmed
statusReason: ValidationError: category must be 1..60 chars (after trim)

[Survived] ArrayDeclaration
modules/safety/domain/scam-report.entity.ts:102:21
     if (category.length === 0 || category.length > SCAM_MAX_CATEGORY_LENGTH) {
       throw new ValidationError(
         `category must be 1..${SCAM_MAX_CATEGORY_LENGTH} chars (after trim)`,
-        { category: ['out of range'] },
+        { category: [] },
         { length: category.length },
         'INVALID_SCAM_REPORT',

[Killed] ConditionalExpression
modules/safety/domain/scam-report.entity.ts:107:9
         'INVALID_SCAM_REPORT',
       );
     }
-    if (!SCAM_SEVERITIES.includes(input.severity)) {
+    if (true) {
       throw new ValidationError(
         `severity must be one of ${SCAM_SEVERITIES.join(' | ')}`,
killedBy: ScamReport.create() (unit — domain invariants) happy path returns the input with category/description trimmed
statusReason: ValidationError: severity must be one of low | medium | high | critical

[Killed] BlockStatement
modules/safety/domain/scam-report.entity.ts:107:52
         'INVALID_SCAM_REPORT',
       );
     }
-    if (!SCAM_SEVERITIES.includes(input.severity)) {
-      throw new ValidationError(
-        `severity must be one of ${SCAM_SEVERITIES.join(' | ')}`,
-        { severity: [`unknown: ${input.severity}`] },
-        { severity: input.severity },
-        'INVALID_SCAM_REPORT',
-      );
-    }
+    if (!SCAM_SEVERITIES.includes(input.severity)) {}
     const description = input.description.trim();
     if (description.length === 0 || description.length > SCAM_MAX_DESCRIPTION_LENGTH) {
killedBy: ScamReport.create() (unit — domain invariants) S3 rejects an unknown severity
statusReason: Error: Expected ScamReport.create() to throw INVALID_SCAM_REPORT, but it succeeded

[Survived] ArrayDeclaration
modules/safety/domain/scam-report.entity.ts:110:21
     if (!SCAM_SEVERITIES.includes(input.severity)) {
       throw new ValidationError(
         `severity must be one of ${SCAM_SEVERITIES.join(' | ')}`,
-        { severity: [`unknown: ${input.severity}`] },
+        { severity: [] },
         { severity: input.severity },
         'INVALID_SCAM_REPORT',

[Killed] MethodExpression
modules/safety/domain/scam-report.entity.ts:115:25
         'INVALID_SCAM_REPORT',
       );
     }
-    const description = input.description.trim();
+    const description = input.description;
     if (description.length === 0 || description.length > SCAM_MAX_DESCRIPTION_LENGTH) {
       throw new ValidationError(
killedBy: ScamReport.create() (unit — domain invariants) happy path returns the input with category/description trimmed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "spaces around"
Received: "  spaces around  "

[Killed] ConditionalExpression
modules/safety/domain/scam-report.entity.ts:116:9
       );
     }
     const description = input.description.trim();
-    if (description.length === 0 || description.length > SCAM_MAX_DESCRIPTION_LENGTH) {
+    if (false) {
       throw new ValidationError(
         `description must be 1..${SCAM_MAX_DESCRIPTION_LENGTH} chars (after trim)`,
killedBy: ScamReport.create() (unit — domain invariants) S4 rejects empty / overlong description
statusReason: Error: Expected ScamReport.create() to throw INVALID_SCAM_REPORT, but it succeeded

[Killed] ConditionalExpression
modules/safety/domain/scam-report.entity.ts:116:9
       );
     }
     const description = input.description.trim();
-    if (description.length === 0 || description.length > SCAM_MAX_DESCRIPTION_LENGTH) {
+    if (false || description.length > SCAM_MAX_DESCRIPTION_LENGTH) {
       throw new ValidationError(
         `description must be 1..${SCAM_MAX_DESCRIPTION_LENGTH} chars (after trim)`,
killedBy: ScamReport.create() (unit — domain invariants) S4 rejects empty / overlong description
statusReason: Error: Expected ScamReport.create() to throw INVALID_SCAM_REPORT, but it succeeded

[Survived] ArrayDeclaration
modules/safety/domain/scam-report.entity.ts:119:24
     if (description.length === 0 || description.length > SCAM_MAX_DESCRIPTION_LENGTH) {
       throw new ValidationError(
         `description must be 1..${SCAM_MAX_DESCRIPTION_LENGTH} chars (after trim)`,
-        { description: ['out of range'] },
+        { description: [] },
         { length: description.length },
         'INVALID_SCAM_REPORT',

[Killed] LogicalOperator
modules/safety/domain/scam-report.entity.ts:124:26
         'INVALID_SCAM_REPORT',
       );
     }
-    const evidenceUrls = input.evidenceUrls ?? [];
+    const evidenceUrls = input.evidenceUrls && [];
     if (evidenceUrls.length > SCAM_MAX_EVIDENCE_URLS) {
       throw new ValidationError(
killedBy: ScamReport.create() (unit — domain invariants) S5 rejects > 5 evidence URLs
statusReason: Error: Expected ScamReport.create() to throw INVALID_SCAM_REPORT, but it succeeded

[Killed] ConditionalExpression
modules/safety/domain/scam-report.entity.ts:125:9
       );
     }
     const evidenceUrls = input.evidenceUrls ?? [];
-    if (evidenceUrls.length > SCAM_MAX_EVIDENCE_URLS) {
+    if (true) {
       throw new ValidationError(
         `evidenceUrls must have ≤ ${SCAM_MAX_EVIDENCE_URLS} entries`,
killedBy: ScamReport.create() (unit — domain invariants) happy path returns the input with category/description trimmed
statusReason: ValidationError: evidenceUrls must have ≤ 5 entries

[Killed] EqualityOperator
modules/safety/domain/scam-report.entity.ts:125:9
       );
     }
     const evidenceUrls = input.evidenceUrls ?? [];
-    if (evidenceUrls.length > SCAM_MAX_EVIDENCE_URLS) {
+    if (evidenceUrls.length <= SCAM_MAX_EVIDENCE_URLS) {
       throw new ValidationError(
         `evidenceUrls must have ≤ ${SCAM_MAX_EVIDENCE_URLS} entries`,
killedBy: ScamReport.create() (unit — domain invariants) happy path returns the input with category/description trimmed
statusReason: ValidationError: evidenceUrls must have ≤ 5 entries

[Killed] BlockStatement
modules/safety/domain/scam-report.entity.ts:133:37
         'INVALID_SCAM_REPORT',
       );
     }
-    for (const url of evidenceUrls) {
-      if (typeof url !== 'string' || url.length === 0 || url.length > SCAM_MAX_URL_LENGTH) {
-        throw new ValidationError(
-          `each evidence URL must be 1..${SCAM_MAX_URL_LENGTH} chars`,
-          { evidenceUrls: ['entry out of range'] },
-          { url, length: url?.length ?? 0 },
-          'INVALID_SCAM_REPORT',
-        );
-      }
-    }
+    for (const url of evidenceUrls) {}
     const out: CreateScamReportInput = {
       reporterId: input.reporterId,
killedBy: ScamReport.create() (unit — domain invariants) S5 rejects an empty or overlong evidence URL entry
statusReason: Error: Expected ScamReport.create() to throw INVALID_SCAM_REPORT, but it succeeded

[Killed] EqualityOperator
modules/safety/domain/scam-report.entity.ts:134:58
       );
     }
     for (const url of evidenceUrls) {
-      if (typeof url !== 'string' || url.length === 0 || url.length > SCAM_MAX_URL_LENGTH) {
+      if (typeof url !== 'string' || url.length === 0 || url.length <= SCAM_MAX_URL_LENGTH) {
         throw new ValidationError(
           `each evidence URL must be 1..${SCAM_MAX_URL_LENGTH} chars`,
killedBy: ScamReport.create() (unit — domain invariants) happy path returns the input with category/description trimmed
statusReason: ValidationError: each evidence URL must be 1..500 chars

[Killed] BlockStatement
modules/safety/domain/scam-report.entity.ts:134:92
       );
     }
     for (const url of evidenceUrls) {
-      if (typeof url !== 'string' || url.length === 0 || url.length > SCAM_MAX_URL_LENGTH) {
-        throw new ValidationError(
-          `each evidence URL must be 1..${SCAM_MAX_URL_LENGTH} chars`,
-          { evidenceUrls: ['entry out of range'] },
-          { url, length: url?.length ?? 0 },
-          'INVALID_SCAM_REPORT',
-        );
-      }
+      if (typeof url !== 'string' || url.length === 0 || url.length > SCAM_MAX_URL_LENGTH) {}
     }
     const out: CreateScamReportInput = {
killedBy: ScamReport.create() (unit — domain invariants) S5 rejects an empty or overlong evidence URL entry
statusReason: Error: Expected ScamReport.create() to throw INVALID_SCAM_REPORT, but it succeeded

[Survived] OptionalChaining
modules/safety/domain/scam-report.entity.ts:138:26
         throw new ValidationError(
           `each evidence URL must be 1..${SCAM_MAX_URL_LENGTH} chars`,
           { evidenceUrls: ['entry out of range'] },
-          { url, length: url?.length ?? 0 },
+          { url, length: url.length ?? 0 },
           'INVALID_SCAM_REPORT',
         );

[Survived] LogicalOperator
modules/safety/domain/scam-report.entity.ts:138:26
         throw new ValidationError(
           `each evidence URL must be 1..${SCAM_MAX_URL_LENGTH} chars`,
           { evidenceUrls: ['entry out of range'] },
-          { url, length: url?.length ?? 0 },
+          { url, length: url?.length && 0 },
           'INVALID_SCAM_REPORT',
         );

[Killed] BlockStatement
modules/safety/domain/scam-report.entity.ts:154:69
   }
 
   /** Wrap a persisted row in a `ScamReport` instance. */
-  static fromPersistence(row: ScamReportPersistenceRow): ScamReport {
-    return new ScamReport(row);
-  }
+  static fromPersistence(row: ScamReportPersistenceRow): ScamReport {}
 }
 
killedBy: ScamReport.fromPersistence() (unit) round-trips a DB row into a class instance
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ScamReport

Received value has no prototype
Received value: undefined
