[Killed] BlockStatement
modules/safety/domain/sos-event.entity.ts:51:52
   readonly resolutionNote: string | null;
   readonly createdAt: Date;
 
-  private constructor(row: SosEventPersistenceRow) {
-    this.id = row.id;
-    this.userId = row.userId;
-    this.trigger = row.trigger;
-    this.resolvedAt = row.resolvedAt;
-    this.resolutionNote = row.resolutionNote;
-    this.createdAt = row.createdAt;
-  }
+  private constructor(row: SosEventPersistenceRow) {}
 
   /**
killedBy: SosEvent.fromPersistence() (unit) round-trips a DB row into a class instance
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BlockStatement
modules/safety/domain/sos-event.entity.ts:65:66
    * `SosEventRepository.create()`. Throws `ValidationError` on any
    * invariant break.
    */
-  static create(input: CreateSosEventInput): CreateSosEventInput {
-    if (typeof input.userId !== 'string' || input.userId.length === 0) {
-      throw new ValidationError(
-        'userId must be a non-empty string',
-        { userId: ['must be non-empty'] },
-        {},
-        'INVALID_SOS_EVENT',
-      );
-    }
-    const trigger = input.trigger.trim();
-    if (trigger.length === 0 || trigger.length > SOS_MAX_TRIGGER_LENGTH) {
-      throw new ValidationError(
-        `trigger must be 1..${SOS_MAX_TRIGGER_LENGTH} chars (after trim)`,
-        { trigger: ['out of range'] },
-        { length: trigger.length },
-        'INVALID_SOS_EVENT',
-      );
-    }
-    return { userId: input.userId, trigger };
-  }
+  static create(input: CreateSosEventInput): CreateSosEventInput {}
 
   /** Validate the resolution note used when an admin/owner resolves
killedBy: SosEvent.create() (unit — domain invariants) happy path returns the input with trigger trimmed
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"trigger": "manual_tap", "userId": "user_alice"}
Received: undefined

[Killed] ConditionalExpression
modules/safety/domain/sos-event.entity.ts:66:9
    * invariant break.
    */
   static create(input: CreateSosEventInput): CreateSosEventInput {
-    if (typeof input.userId !== 'string' || input.userId.length === 0) {
+    if (false) {
       throw new ValidationError(
         'userId must be a non-empty string',
killedBy: SosEvent.create() (unit — domain invariants) O1 rejects an empty userId
statusReason: Error: Expected SosEvent.create() to throw INVALID_SOS_EVENT, but it succeeded

[Killed] LogicalOperator
modules/safety/domain/sos-event.entity.ts:66:9
    * invariant break.
    */
   static create(input: CreateSosEventInput): CreateSosEventInput {
-    if (typeof input.userId !== 'string' || input.userId.length === 0) {
+    if (typeof input.userId !== 'string' && input.userId.length === 0) {
       throw new ValidationError(
         'userId must be a non-empty string',
killedBy: SosEvent.create() (unit — domain invariants) O1 rejects an empty userId
statusReason: Error: Expected SosEvent.create() to throw INVALID_SOS_EVENT, but it succeeded

[Survived] ArrayDeclaration
modules/safety/domain/sos-event.entity.ts:69:19
     if (typeof input.userId !== 'string' || input.userId.length === 0) {
       throw new ValidationError(
         'userId must be a non-empty string',
-        { userId: ['must be non-empty'] },
+        { userId: [] },
         {},
         'INVALID_SOS_EVENT',

[Killed] MethodExpression
modules/safety/domain/sos-event.entity.ts:74:21
         'INVALID_SOS_EVENT',
       );
     }
-    const trigger = input.trigger.trim();
+    const trigger = input.trigger;
     if (trigger.length === 0 || trigger.length > SOS_MAX_TRIGGER_LENGTH) {
       throw new ValidationError(
killedBy: SosEvent.create() (unit — domain invariants) happy path returns the input with trigger trimmed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "trigger": "manual_tap",
+   "trigger": "  manual_tap  ",

[Killed] ConditionalExpression
modules/safety/domain/sos-event.entity.ts:75:9
       );
     }
     const trigger = input.trigger.trim();
-    if (trigger.length === 0 || trigger.length > SOS_MAX_TRIGGER_LENGTH) {
+    if (false) {
       throw new ValidationError(
         `trigger must be 1..${SOS_MAX_TRIGGER_LENGTH} chars (after trim)`,
killedBy: SosEvent.create() (unit — domain invariants) O2 rejects an empty / overlong trigger
statusReason: Error: Expected SosEvent.create() to throw INVALID_SOS_EVENT, but it succeeded

[Killed] ConditionalExpression
modules/safety/domain/sos-event.entity.ts:75:9
       );
     }
     const trigger = input.trigger.trim();
-    if (trigger.length === 0 || trigger.length > SOS_MAX_TRIGGER_LENGTH) {
+    if (false || trigger.length > SOS_MAX_TRIGGER_LENGTH) {
       throw new ValidationError(
         `trigger must be 1..${SOS_MAX_TRIGGER_LENGTH} chars (after trim)`,
killedBy: SosEvent.create() (unit — domain invariants) O2 rejects an empty / overlong trigger
statusReason: Error: Expected SosEvent.create() to throw INVALID_SOS_EVENT, but it succeeded

[Killed] BlockStatement
modules/safety/domain/sos-event.entity.ts:88:82
 
   /** Validate the resolution note used when an admin/owner resolves
    *  an SOS event. Empty/whitespace → null (caller can store null). */
-  static normaliseResolutionNote(note: string | null | undefined): string | null {
-    if (note === null || note === undefined) return null;
-    const trimmed = note.trim();
-    if (trimmed.length === 0) return null;
-    if (trimmed.length > SOS_MAX_RESOLUTION_NOTE_LENGTH) {
-      throw new ValidationError(
-        `resolutionNote must be ≤ ${SOS_MAX_RESOLUTION_NOTE_LENGTH} chars`,
-        { resolutionNote: ['too long'] },
-        { length: trimmed.length },
-        'INVALID_SOS_EVENT',
-      );
-    }
-    return trimmed;
-  }
+  static normaliseResolutionNote(note: string | null | undefined): string | null {}
 
   /** Wrap a persisted row in a `SosEvent` instance. */
killedBy: SosEvent.normaliseResolutionNote() (unit) null / undefined / empty-after-trim → null
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] EqualityOperator
modules/safety/domain/sos-event.entity.ts:89:26
   /** Validate the resolution note used when an admin/owner resolves
    *  an SOS event. Empty/whitespace → null (caller can store null). */
   static normaliseResolutionNote(note: string | null | undefined): string | null {
-    if (note === null || note === undefined) return null;
+    if (note === null || note !== undefined) return null;
     const trimmed = note.trim();
     if (trimmed.length === 0) return null;
killedBy: SosEvent.normaliseResolutionNote() (unit) null / undefined / empty-after-trim → null
statusReason: TypeError: Cannot read properties of undefined (reading 'trim')

[Killed] LogicalOperator
modules/safety/domain/sos-event.entity.ts:89:9
   /** Validate the resolution note used when an admin/owner resolves
    *  an SOS event. Empty/whitespace → null (caller can store null). */
   static normaliseResolutionNote(note: string | null | undefined): string | null {
-    if (note === null || note === undefined) return null;
+    if (note === null && note === undefined) return null;
     const trimmed = note.trim();
     if (trimmed.length === 0) return null;
killedBy: SosEvent.normaliseResolutionNote() (unit) null / undefined / empty-after-trim → null
statusReason: TypeError: Cannot read properties of null (reading 'trim')

[Killed] MethodExpression
modules/safety/domain/sos-event.entity.ts:90:21
    *  an SOS event. Empty/whitespace → null (caller can store null). */
   static normaliseResolutionNote(note: string | null | undefined): string | null {
     if (note === null || note === undefined) return null;
-    const trimmed = note.trim();
+    const trimmed = note;
     if (trimmed.length === 0) return null;
     if (trimmed.length > SOS_MAX_RESOLUTION_NOTE_LENGTH) {
killedBy: SosEvent.normaliseResolutionNote() (unit) null / undefined / empty-after-trim → null
statusReason: Error: expect(received).toBeNull()

Received: "   "

[Killed] ConditionalExpression
modules/safety/domain/sos-event.entity.ts:91:9
   static normaliseResolutionNote(note: string | null | undefined): string | null {
     if (note === null || note === undefined) return null;
     const trimmed = note.trim();
-    if (trimmed.length === 0) return null;
+    if (false) return null;
     if (trimmed.length > SOS_MAX_RESOLUTION_NOTE_LENGTH) {
       throw new ValidationError(
killedBy: SosEvent.normaliseResolutionNote() (unit) null / undefined / empty-after-trim → null
statusReason: Error: expect(received).toBeNull()

Received: ""

[Killed] ConditionalExpression
modules/safety/domain/sos-event.entity.ts:91:9
   static normaliseResolutionNote(note: string | null | undefined): string | null {
     if (note === null || note === undefined) return null;
     const trimmed = note.trim();
-    if (trimmed.length === 0) return null;
+    if (true) return null;
     if (trimmed.length > SOS_MAX_RESOLUTION_NOTE_LENGTH) {
       throw new ValidationError(
killedBy: SosEvent.normaliseResolutionNote() (unit) trims and returns a non-empty note
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ok"
Received: null

[Killed] ConditionalExpression
modules/safety/domain/sos-event.entity.ts:92:9
     if (note === null || note === undefined) return null;
     const trimmed = note.trim();
     if (trimmed.length === 0) return null;
-    if (trimmed.length > SOS_MAX_RESOLUTION_NOTE_LENGTH) {
+    if (false) {
       throw new ValidationError(
         `resolutionNote must be ≤ ${SOS_MAX_RESOLUTION_NOTE_LENGTH} chars`,
killedBy: SosEvent.normaliseResolutionNote() (unit) rejects a note longer than 2000 chars
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] BlockStatement
modules/safety/domain/sos-event.entity.ts:92:58
     if (note === null || note === undefined) return null;
     const trimmed = note.trim();
     if (trimmed.length === 0) return null;
-    if (trimmed.length > SOS_MAX_RESOLUTION_NOTE_LENGTH) {
-      throw new ValidationError(
-        `resolutionNote must be ≤ ${SOS_MAX_RESOLUTION_NOTE_LENGTH} chars`,
-        { resolutionNote: ['too long'] },
-        { length: trimmed.length },
-        'INVALID_SOS_EVENT',
-      );
-    }
+    if (trimmed.length > SOS_MAX_RESOLUTION_NOTE_LENGTH) {}
     return trimmed;
   }
killedBy: SosEvent.normaliseResolutionNote() (unit) rejects a note longer than 2000 chars
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Survived] ArrayDeclaration
modules/safety/domain/sos-event.entity.ts:95:27
     if (trimmed.length > SOS_MAX_RESOLUTION_NOTE_LENGTH) {
       throw new ValidationError(
         `resolutionNote must be ≤ ${SOS_MAX_RESOLUTION_NOTE_LENGTH} chars`,
-        { resolutionNote: ['too long'] },
+        { resolutionNote: [] },
         { length: trimmed.length },
         'INVALID_SOS_EVENT',

[Killed] BlockStatement
modules/safety/domain/sos-event.entity.ts:104:65
   }
 
   /** Wrap a persisted row in a `SosEvent` instance. */
-  static fromPersistence(row: SosEventPersistenceRow): SosEvent {
-    return new SosEvent(row);
-  }
+  static fromPersistence(row: SosEventPersistenceRow): SosEvent {}
 }
 
killedBy: SosEvent.fromPersistence() (unit) round-trips a DB row into a class instance
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: SosEvent

Received value has no prototype
Received value: undefined
