[Killed] Regex
modules/social/domain/review.entity.ts:39:24
 export const REVIEW_MIN_RATING = 1;
 export const REVIEW_MAX_RATING = 5;
 export const REVIEW_MAX_BODY_LENGTH = 5000;
-const LANGUAGE_REGEX = /^[a-z]{2}$/;
+const LANGUAGE_REGEX = /^[^a-z]{2}$/;
 
 /** Input shape for `Review.create()` — the new-review payload BEFORE
killedBy: Review.create() (unit — domain invariants) happy path returns the input, body trimmed + language lowercased
statusReason: ValidationError: Language must be a 2-letter ISO 639-1 code

[Killed] BlockStatement
modules/social/domain/review.entity.ts:92:50
   readonly createdAt: Date;
   readonly updatedAt: Date;
 
-  private constructor(row: ReviewPersistenceRow) {
-    this.id = row.id;
-    this.authorId = row.authorId;
-    this.tripId = row.tripId;
-    this.targetType = row.targetType;
-    this.targetId = row.targetId;
-    this.rating = row.rating;
-    this.body = row.body;
-    this.language = row.language;
-    this.verifiedBooking = row.verifiedBooking;
-    this.responseBody = row.responseBody;
-    this.responseAt = row.responseAt;
-    this.createdAt = row.createdAt;
-    this.updatedAt = row.updatedAt;
-  }
+  private constructor(row: ReviewPersistenceRow) {}
 
   /**
killedBy: Review.fromPersistence() (unit) round-trips a DB row into a class instance
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rev_1"
Received: undefined

[Killed] LogicalOperator
modules/social/domain/review.entity.ts:121:7
    */
   static create(input: CreateReviewInput): CreateReviewInput {
     if (
-      !Number.isInteger(input.rating) ||
-      input.rating < REVIEW_MIN_RATING ||
-      input.rating > REVIEW_MAX_RATING
+      (!Number.isInteger(input.rating) || input.rating < REVIEW_MIN_RATING) && input.rating > REVIEW_MAX_RATING
     ) {
       throw new ValidationError(
killedBy: Review.create() (unit — domain invariants) R1 rejects a rating outside [1,5] or non-integer
statusReason: Error: Expected Review.create() to throw INVALID_RATING, but it succeeded

[Killed] ConditionalExpression
modules/social/domain/review.entity.ts:121:7
    */
   static create(input: CreateReviewInput): CreateReviewInput {
     if (
-      !Number.isInteger(input.rating) ||
-      input.rating < REVIEW_MIN_RATING ||
-      input.rating > REVIEW_MAX_RATING
+      false
     ) {
       throw new ValidationError(
killedBy: Review.create() (unit — domain invariants) R1 rejects a rating outside [1,5] or non-integer
statusReason: Error: Expected Review.create() to throw INVALID_RATING, but it succeeded

[Killed] EqualityOperator
modules/social/domain/review.entity.ts:122:7
   static create(input: CreateReviewInput): CreateReviewInput {
     if (
       !Number.isInteger(input.rating) ||
-      input.rating < REVIEW_MIN_RATING ||
+      input.rating >= REVIEW_MIN_RATING ||
       input.rating > REVIEW_MAX_RATING
     ) {
killedBy: Review.create() (unit — domain invariants) happy path returns the input, body trimmed + language lowercased
statusReason: ValidationError: Rating must be an integer between 1 and 5

[Killed] ConditionalExpression
modules/social/domain/review.entity.ts:122:7
   static create(input: CreateReviewInput): CreateReviewInput {
     if (
       !Number.isInteger(input.rating) ||
-      input.rating < REVIEW_MIN_RATING ||
+      false ||
       input.rating > REVIEW_MAX_RATING
     ) {
killedBy: Review.create() (unit — domain invariants) R1 rejects a rating outside [1,5] or non-integer
statusReason: Error: Expected Review.create() to throw INVALID_RATING, but it succeeded

[Killed] EqualityOperator
modules/social/domain/review.entity.ts:123:7
     if (
       !Number.isInteger(input.rating) ||
       input.rating < REVIEW_MIN_RATING ||
-      input.rating > REVIEW_MAX_RATING
+      input.rating >= REVIEW_MAX_RATING
     ) {
       throw new ValidationError(
killedBy: Review.create() (unit — domain invariants) happy path returns the input, body trimmed + language lowercased
statusReason: ValidationError: Rating must be an integer between 1 and 5

[Killed] ConditionalExpression
modules/social/domain/review.entity.ts:123:7
     if (
       !Number.isInteger(input.rating) ||
       input.rating < REVIEW_MIN_RATING ||
-      input.rating > REVIEW_MAX_RATING
+      false
     ) {
       throw new ValidationError(
killedBy: Review.create() (unit — domain invariants) R1 rejects a rating outside [1,5] or non-integer
statusReason: Error: Expected Review.create() to throw INVALID_RATING, but it succeeded

[Killed] BlockStatement
modules/social/domain/review.entity.ts:124:7
       !Number.isInteger(input.rating) ||
       input.rating < REVIEW_MIN_RATING ||
       input.rating > REVIEW_MAX_RATING
-    ) {
-      throw new ValidationError(
-        `Rating must be an integer between ${REVIEW_MIN_RATING} and ${REVIEW_MAX_RATING}`,
-        { rating: [`must be integer in [${REVIEW_MIN_RATING}, ${REVIEW_MAX_RATING}]`] },
-        { rating: input.rating },
-        'INVALID_RATING',
-      );
-    }
+    ) {}
     const body = input.body.trim();
     if (body.length === 0) {
killedBy: Review.create() (unit — domain invariants) R1 rejects a rating outside [1,5] or non-integer
statusReason: Error: Expected Review.create() to throw INVALID_RATING, but it succeeded

[Killed] EqualityOperator
modules/social/domain/review.entity.ts:133:9
       );
     }
     const body = input.body.trim();
-    if (body.length === 0) {
+    if (body.length !== 0) {
       throw new ValidationError(
         'Review body cannot be empty',
killedBy: Review.create() (unit — domain invariants) happy path returns the input, body trimmed + language lowercased
statusReason: ValidationError: Review body cannot be empty

[Killed] ConditionalExpression
modules/social/domain/review.entity.ts:133:9
       );
     }
     const body = input.body.trim();
-    if (body.length === 0) {
+    if (false) {
       throw new ValidationError(
         'Review body cannot be empty',
killedBy: Review.create() (unit — domain invariants) R2 rejects an empty body (after trim)
statusReason: Error: Expected Review.create() to throw INVALID_REVIEW_BODY, but it succeeded

[Survived] ArrayDeclaration
modules/social/domain/review.entity.ts:136:17
     if (body.length === 0) {
       throw new ValidationError(
         'Review body cannot be empty',
-        { body: ['must be non-empty'] },
+        { body: [] },
         {},
         'INVALID_REVIEW_BODY',

[Killed] BlockStatement
modules/social/domain/review.entity.ts:141:47
         'INVALID_REVIEW_BODY',
       );
     }
-    if (body.length > REVIEW_MAX_BODY_LENGTH) {
-      throw new ValidationError(
-        'Review body too long',
-        { body: [`must be ≤ ${REVIEW_MAX_BODY_LENGTH} chars (got ${body.length})`] },
-        { length: body.length },
-        'INVALID_REVIEW_BODY',
-      );
-    }
+    if (body.length > REVIEW_MAX_BODY_LENGTH) {}
     const language = input.language.toLowerCase();
     if (!LANGUAGE_REGEX.test(language)) {
killedBy: Review.create() (unit — domain invariants) R2 rejects a body longer than 5000 chars
statusReason: Error: Expected Review.create() to throw INVALID_REVIEW_BODY, but it succeeded

[Killed] ConditionalExpression
modules/social/domain/review.entity.ts:141:9
         'INVALID_REVIEW_BODY',
       );
     }
-    if (body.length > REVIEW_MAX_BODY_LENGTH) {
+    if (false) {
       throw new ValidationError(
         'Review body too long',
killedBy: Review.create() (unit — domain invariants) R2 rejects a body longer than 5000 chars
statusReason: Error: Expected Review.create() to throw INVALID_REVIEW_BODY, but it succeeded

[Killed] MethodExpression
modules/social/domain/review.entity.ts:149:22
         'INVALID_REVIEW_BODY',
       );
     }
-    const language = input.language.toLowerCase();
+    const language = input.language.toUpperCase();
     if (!LANGUAGE_REGEX.test(language)) {
       throw new ValidationError(
killedBy: Review.create() (unit — domain invariants) happy path returns the input, body trimmed + language lowercased
statusReason: ValidationError: Language must be a 2-letter ISO 639-1 code

[Killed] ConditionalExpression
modules/social/domain/review.entity.ts:150:9
       );
     }
     const language = input.language.toLowerCase();
-    if (!LANGUAGE_REGEX.test(language)) {
+    if (false) {
       throw new ValidationError(
         'Language must be a 2-letter ISO 639-1 code',
killedBy: Review.create() (unit — domain invariants) R3 rejects a language that is not 2 lowercase letters
statusReason: Error: Expected Review.create() to throw INVALID_LANGUAGE, but it succeeded

[Killed] BlockStatement
modules/social/domain/review.entity.ts:150:41
       );
     }
     const language = input.language.toLowerCase();
-    if (!LANGUAGE_REGEX.test(language)) {
-      throw new ValidationError(
-        'Language must be a 2-letter ISO 639-1 code',
-        { language: ['must be 2 lowercase letters'] },
-        { language: input.language },
-        'INVALID_LANGUAGE',
-      );
-    }
+    if (!LANGUAGE_REGEX.test(language)) {}
     return { ...input, body, language };
   }
killedBy: Review.create() (unit — domain invariants) R3 rejects a language that is not 2 lowercase letters
statusReason: Error: Expected Review.create() to throw INVALID_LANGUAGE, but it succeeded

[Killed] BlockStatement
modules/social/domain/review.entity.ts:163:61
 
   /** Wrap a persisted row in a `Review` instance. DB rows are by
    *  construction already valid; no re-validation runs here. */
-  static fromPersistence(row: ReviewPersistenceRow): Review {
-    return new Review(row);
-  }
+  static fromPersistence(row: ReviewPersistenceRow): Review {}
 }
 
killedBy: Review.fromPersistence() (unit) round-trips a DB row into a class instance
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Review

Received value has no prototype
Received value: undefined
