[Killed] BlockStatement
modules/social/domain/trip-comment.entity.ts:48:55
   readonly createdAt: Date;
   readonly updatedAt: Date;
 
-  private constructor(row: TripCommentPersistenceRow) {
-    this.id = row.id;
-    this.tripId = row.tripId;
-    this.authorId = row.authorId;
-    this.body = row.body;
-    this.createdAt = row.createdAt;
-    this.updatedAt = row.updatedAt;
-  }
+  private constructor(row: TripCommentPersistenceRow) {}
 
   /**
killedBy: TripComment.fromPersistence() (unit) round-trips a DB row into a class instance
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "looks great!"
Received: undefined

[Killed] BlockStatement
modules/social/domain/trip-comment.entity.ts:65:72
    *   T1 body trims to non-empty
    *   T2 trimmed body ≤ MAX_COMMENT_LENGTH
    */
-  static create(input: CreateTripCommentInput): CreateTripCommentInput {
-    const body = input.body.trim();
-    if (body.length === 0) {
-      throw new ValidationError(
-        'Comment cannot be empty',
-        { body: ['must be non-empty'] },
-        {},
-        'INVALID_COMMENT_BODY',
-      );
-    }
-    if (body.length > MAX_COMMENT_LENGTH) {
-      throw new ValidationError(
-        'Comment too long',
-        { body: [`must be ≤ ${MAX_COMMENT_LENGTH} chars (got ${body.length})`] },
-        { length: body.length },
-        'INVALID_COMMENT_BODY',
-      );
-    }
-    return { ...input, body };
-  }
+  static create(input: CreateTripCommentInput): CreateTripCommentInput {}
 
   /** Wrap a persisted row in a `TripComment` instance. */
killedBy: TripComment.create() (unit — domain invariants) happy path returns the input with body trimmed
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"authorId": "user_alice", "body": "hi", "tripId": "trip_1"}
Received: undefined

[Killed] MethodExpression
modules/social/domain/trip-comment.entity.ts:66:18
    *   T2 trimmed body ≤ MAX_COMMENT_LENGTH
    */
   static create(input: CreateTripCommentInput): CreateTripCommentInput {
-    const body = input.body.trim();
+    const body = input.body;
     if (body.length === 0) {
       throw new ValidationError(
killedBy: TripComment.create() (unit — domain invariants) happy path returns the input with body trimmed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "authorId": "user_alice",
-   "body": "hi",

[Killed] ConditionalExpression
modules/social/domain/trip-comment.entity.ts:67:9
    */
   static create(input: CreateTripCommentInput): CreateTripCommentInput {
     const body = input.body.trim();
-    if (body.length === 0) {
+    if (true) {
       throw new ValidationError(
         'Comment cannot be empty',
killedBy: TripComment.create() (unit — domain invariants) happy path returns the input with body trimmed
statusReason: ValidationError: Comment cannot be empty

[Killed] ConditionalExpression
modules/social/domain/trip-comment.entity.ts:75:9
         'INVALID_COMMENT_BODY',
       );
     }
-    if (body.length > MAX_COMMENT_LENGTH) {
+    if (true) {
       throw new ValidationError(
         'Comment too long',
killedBy: TripComment.create() (unit — domain invariants) happy path returns the input with body trimmed
statusReason: ValidationError: Comment too long

[Killed] BlockStatement
modules/social/domain/trip-comment.entity.ts:75:43
         'INVALID_COMMENT_BODY',
       );
     }
-    if (body.length > MAX_COMMENT_LENGTH) {
-      throw new ValidationError(
-        'Comment too long',
-        { body: [`must be ≤ ${MAX_COMMENT_LENGTH} chars (got ${body.length})`] },
-        { length: body.length },
-        'INVALID_COMMENT_BODY',
-      );
-    }
+    if (body.length > MAX_COMMENT_LENGTH) {}
     return { ...input, body };
   }
killedBy: TripComment.create() (unit — domain invariants) T2 rejects a body longer than 1000 chars
statusReason: Error: Expected TripComment.create() to throw INVALID_COMMENT_BODY, but it succeeded

[Survived] ArrayDeclaration
modules/social/domain/trip-comment.entity.ts:78:17
     if (body.length > MAX_COMMENT_LENGTH) {
       throw new ValidationError(
         'Comment too long',
-        { body: [`must be ≤ ${MAX_COMMENT_LENGTH} chars (got ${body.length})`] },
+        { body: [] },
         { length: body.length },
         'INVALID_COMMENT_BODY',

[Killed] BlockStatement
modules/social/domain/trip-comment.entity.ts:87:71
   }
 
   /** Wrap a persisted row in a `TripComment` instance. */
-  static fromPersistence(row: TripCommentPersistenceRow): TripComment {
-    return new TripComment(row);
-  }
+  static fromPersistence(row: TripCommentPersistenceRow): TripComment {}
 }
 
killedBy: TripComment.fromPersistence() (unit) round-trips a DB row into a class instance
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: TripComment

Received value has no prototype
Received value: undefined
