[Killed] UnaryOperator
modules/social/domain/vote.entity.ts:32:51
 ];
 
 export type VoteValue = -1 | 0 | 1;
-export const VOTE_VALUES: readonly VoteValue[] = [-1, 0, 1];
+export const VOTE_VALUES: readonly VoteValue[] = [+1, 0, 1];
 
 /** Input shape for `Vote.create()` — the upsert payload BEFORE the
killedBy: Vote.create() (unit — domain invariants) V1 accepts each legal value (-1, 0, +1)
statusReason: ValidationError: value must be -1, 0, or +1

[Killed] BlockStatement
modules/social/domain/vote.entity.ts:64:48
   readonly value: VoteValue;
   readonly createdAt: Date;
 
-  private constructor(row: VotePersistenceRow) {
-    this.id = row.id;
-    this.tripId = row.tripId;
-    this.userId = row.userId;
-    this.targetType = row.targetType;
-    this.targetId = row.targetId;
-    this.value = row.value;
-    this.createdAt = row.createdAt;
-  }
+  private constructor(row: VotePersistenceRow) {}
 
   /**
killedBy: Vote.fromPersistence() (unit) round-trips a DB row into a class instance
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] LogicalOperator
modules/social/domain/vote.entity.ts:80:9
    * invariant break (V1/V2/V3).
    */
   static create(input: CreateVoteInput): CreateVoteInput {
-    if (typeof input.tripId !== 'string' || input.tripId.length === 0) {
+    if (typeof input.tripId !== 'string' && input.tripId.length === 0) {
       throw new ValidationError(
         'tripId must be a non-empty string',
killedBy: Vote.create() (unit — domain invariants) V3 rejects empty tripId / userId / targetId
statusReason: Error: Expected Vote.create() to throw INVALID_VOTE_TARGET, but it succeeded

[Killed] ConditionalExpression
modules/social/domain/vote.entity.ts:80:9
    * invariant break (V1/V2/V3).
    */
   static create(input: CreateVoteInput): CreateVoteInput {
-    if (typeof input.tripId !== 'string' || input.tripId.length === 0) {
+    if (false) {
       throw new ValidationError(
         'tripId must be a non-empty string',
killedBy: Vote.create() (unit — domain invariants) V3 rejects empty tripId / userId / targetId
statusReason: Error: Expected Vote.create() to throw INVALID_VOTE_TARGET, but it succeeded

[Survived] ArrayDeclaration
modules/social/domain/vote.entity.ts:83:19
     if (typeof input.tripId !== 'string' || input.tripId.length === 0) {
       throw new ValidationError(
         'tripId must be a non-empty string',
-        { tripId: ['must be non-empty'] },
+        { tripId: [] },
         {},
         'INVALID_VOTE_TARGET',

[Killed] EqualityOperator
modules/social/domain/vote.entity.ts:88:9
         'INVALID_VOTE_TARGET',
       );
     }
-    if (typeof input.userId !== 'string' || input.userId.length === 0) {
+    if (typeof input.userId === 'string' || input.userId.length === 0) {
       throw new ValidationError(
         'userId must be a non-empty string',
killedBy: Vote.create() (unit — domain invariants) happy path returns the input untouched
statusReason: ValidationError: userId must be a non-empty string

[Killed] EqualityOperator
modules/social/domain/vote.entity.ts:88:45
         'INVALID_VOTE_TARGET',
       );
     }
-    if (typeof input.userId !== 'string' || input.userId.length === 0) {
+    if (typeof input.userId !== 'string' || input.userId.length !== 0) {
       throw new ValidationError(
         'userId must be a non-empty string',
killedBy: Vote.create() (unit — domain invariants) happy path returns the input untouched
statusReason: ValidationError: userId must be a non-empty string

[Killed] BlockStatement
modules/social/domain/vote.entity.ts:96:76
         'INVALID_VOTE_TARGET',
       );
     }
-    if (typeof input.targetId !== 'string' || input.targetId.length === 0) {
-      throw new ValidationError(
-        'targetId must be a non-empty string',
-        { targetId: ['must be non-empty'] },
-        {},
-        'INVALID_VOTE_TARGET',
-      );
-    }
+    if (typeof input.targetId !== 'string' || input.targetId.length === 0) {}
     if (!VOTE_TARGET_TYPES.includes(input.targetType)) {
       throw new ValidationError(
killedBy: Vote.create() (unit — domain invariants) V3 rejects empty tripId / userId / targetId
statusReason: Error: Expected Vote.create() to throw INVALID_VOTE_TARGET, but it succeeded

[Killed] EqualityOperator
modules/social/domain/vote.entity.ts:96:9
         'INVALID_VOTE_TARGET',
       );
     }
-    if (typeof input.targetId !== 'string' || input.targetId.length === 0) {
+    if (typeof input.targetId === 'string' || input.targetId.length === 0) {
       throw new ValidationError(
         'targetId must be a non-empty string',
killedBy: Vote.create() (unit — domain invariants) happy path returns the input untouched
statusReason: ValidationError: targetId must be a non-empty string

[Survived] ArrayDeclaration
modules/social/domain/vote.entity.ts:99:21
     if (typeof input.targetId !== 'string' || input.targetId.length === 0) {
       throw new ValidationError(
         'targetId must be a non-empty string',
-        { targetId: ['must be non-empty'] },
+        { targetId: [] },
         {},
         'INVALID_VOTE_TARGET',

[Killed] BlockStatement
modules/social/domain/vote.entity.ts:104:56
         'INVALID_VOTE_TARGET',
       );
     }
-    if (!VOTE_TARGET_TYPES.includes(input.targetType)) {
-      throw new ValidationError(
-        `targetType must be one of ${VOTE_TARGET_TYPES.join(' | ')}`,
-        { targetType: [`unknown: ${input.targetType}`] },
-        { targetType: input.targetType },
-        'INVALID_VOTE_TARGET',
-      );
-    }
+    if (!VOTE_TARGET_TYPES.includes(input.targetType)) {}
     if (!VOTE_VALUES.includes(input.value)) {
       throw new ValidationError(
killedBy: Vote.create() (unit — domain invariants) V2 rejects an unknown targetType
statusReason: Error: Expected Vote.create() to throw INVALID_VOTE_TARGET, but it succeeded

[Killed] BooleanLiteral
modules/social/domain/vote.entity.ts:104:9
         'INVALID_VOTE_TARGET',
       );
     }
-    if (!VOTE_TARGET_TYPES.includes(input.targetType)) {
+    if (VOTE_TARGET_TYPES.includes(input.targetType)) {
       throw new ValidationError(
         `targetType must be one of ${VOTE_TARGET_TYPES.join(' | ')}`,
killedBy: Vote.create() (unit — domain invariants) happy path returns the input untouched
statusReason: ValidationError: targetType must be one of itinerary_item | place | restaurant

[Survived] ArrayDeclaration
modules/social/domain/vote.entity.ts:107:23
     if (!VOTE_TARGET_TYPES.includes(input.targetType)) {
       throw new ValidationError(
         `targetType must be one of ${VOTE_TARGET_TYPES.join(' | ')}`,
-        { targetType: [`unknown: ${input.targetType}`] },
+        { targetType: [] },
         { targetType: input.targetType },
         'INVALID_VOTE_TARGET',

[Killed] ConditionalExpression
modules/social/domain/vote.entity.ts:112:9
         'INVALID_VOTE_TARGET',
       );
     }
-    if (!VOTE_VALUES.includes(input.value)) {
+    if (true) {
       throw new ValidationError(
         'value must be -1, 0, or +1',
killedBy: Vote.create() (unit — domain invariants) happy path returns the input untouched
statusReason: ValidationError: value must be -1, 0, or +1

[Killed] BooleanLiteral
modules/social/domain/vote.entity.ts:112:9
         'INVALID_VOTE_TARGET',
       );
     }
-    if (!VOTE_VALUES.includes(input.value)) {
+    if (VOTE_VALUES.includes(input.value)) {
       throw new ValidationError(
         'value must be -1, 0, or +1',
killedBy: Vote.create() (unit — domain invariants) happy path returns the input untouched
statusReason: ValidationError: value must be -1, 0, or +1

[Survived] ArrayDeclaration
modules/social/domain/vote.entity.ts:115:18
     if (!VOTE_VALUES.includes(input.value)) {
       throw new ValidationError(
         'value must be -1, 0, or +1',
-        { value: [`unknown: ${input.value}`] },
+        { value: [] },
         { value: input.value },
         'INVALID_VOTE_VALUE',

[Killed] BlockStatement
modules/social/domain/vote.entity.ts:124:57
   }
 
   /** Wrap a persisted row in a `Vote` instance. */
-  static fromPersistence(row: VotePersistenceRow): Vote {
-    return new Vote(row);
-  }
+  static fromPersistence(row: VotePersistenceRow): Vote {}
 }
 
killedBy: Vote.fromPersistence() (unit) round-trips a DB row into a class instance
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Vote

Received value has no prototype
Received value: undefined
