[Killed] BlockStatement
modules/trip/domain/itinerary.entity.ts:66:57
    *  the traveller marks the item done. */
   readonly completedAt: Date | null;
 
-  private constructor(row: ItineraryItemPersistenceRow) {
-    this.id = row.id;
-    this.dayId = row.dayId;
-    this.position = row.position;
-    this.placeId = row.placeId;
-    this.startTime = row.startTime;
-    this.endTime = row.endTime;
-    this.notes = row.notes;
-    this.createdAt = row.createdAt;
-    this.updatedAt = row.updatedAt;
-    this.completedAt = row.completedAt;
-  }
+  private constructor(row: ItineraryItemPersistenceRow) {}
 
   /**
killedBy: ItineraryItem.fromPersistence() (unit) round-trips a DB row into a class instance
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] ConditionalExpression
modules/trip/domain/itinerary.entity.ts:86:9
    * route through it without changing the contract.
    */
   static create(input: CreateItineraryItemInput): CreateItineraryItemInput {
-    if (typeof input.dayId !== 'string' || input.dayId.length === 0) {
+    if (true) {
       throw new ValidationError(
         'dayId must be a non-empty string',
killedBy: ItineraryItem.create() (unit — domain invariants) happy path returns the input with notes trimmed
statusReason: ValidationError: dayId must be a non-empty string

[Killed] LogicalOperator
modules/trip/domain/itinerary.entity.ts:86:9
    * route through it without changing the contract.
    */
   static create(input: CreateItineraryItemInput): CreateItineraryItemInput {
-    if (typeof input.dayId !== 'string' || input.dayId.length === 0) {
+    if (typeof input.dayId !== 'string' && input.dayId.length === 0) {
       throw new ValidationError(
         'dayId must be a non-empty string',
killedBy: ItineraryItem.create() (unit — domain invariants) I1 rejects empty dayId
statusReason: Error: Expected ItineraryItem.create() to throw INVALID_ITINERARY_ITEM, but it succeeded

[Survived] ArrayDeclaration
modules/trip/domain/itinerary.entity.ts:89:18
     if (typeof input.dayId !== 'string' || input.dayId.length === 0) {
       throw new ValidationError(
         'dayId must be a non-empty string',
-        { dayId: ['must be non-empty'] },
+        { dayId: [] },
         {},
         'INVALID_ITINERARY_ITEM',

[Killed] BooleanLiteral
modules/trip/domain/itinerary.entity.ts:94:9
         'INVALID_ITINERARY_ITEM',
       );
     }
-    if (!Number.isInteger(input.position) || input.position < 0) {
+    if (Number.isInteger(input.position) || input.position < 0) {
       throw new ValidationError(
         'position must be a non-negative integer',
killedBy: ItineraryItem.create() (unit — domain invariants) happy path returns the input with notes trimmed
statusReason: ValidationError: position must be a non-negative integer

[Killed] LogicalOperator
modules/trip/domain/itinerary.entity.ts:94:9
         'INVALID_ITINERARY_ITEM',
       );
     }
-    if (!Number.isInteger(input.position) || input.position < 0) {
+    if (!Number.isInteger(input.position) && input.position < 0) {
       throw new ValidationError(
         'position must be a non-negative integer',
killedBy: ItineraryItem.create() (unit — domain invariants) I2 rejects negative / non-integer position
statusReason: Error: Expected ItineraryItem.create() to throw INVALID_ITINERARY_ITEM, but it succeeded

[Killed] MethodExpression
modules/trip/domain/itinerary.entity.ts:102:19
         'INVALID_ITINERARY_ITEM',
       );
     }
-    const notes = input.notes?.trim() || null;
+    const notes = input.notes || null;
     if (notes && notes.length > ITINERARY_ITEM_MAX_NOTES_CHARS) {
       throw new ValidationError(
killedBy: ItineraryItem.create() (unit — domain invariants) happy path returns the input with notes trimmed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "light"
Received: "   light   "

[Killed] LogicalOperator
modules/trip/domain/itinerary.entity.ts:102:19
         'INVALID_ITINERARY_ITEM',
       );
     }
-    const notes = input.notes?.trim() || null;
+    const notes = input.notes?.trim() && null;
     if (notes && notes.length > ITINERARY_ITEM_MAX_NOTES_CHARS) {
       throw new ValidationError(
killedBy: ItineraryItem.create() (unit — domain invariants) happy path returns the input with notes trimmed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "light"
Received: null

[Killed] LogicalOperator
modules/trip/domain/itinerary.entity.ts:103:9
       );
     }
     const notes = input.notes?.trim() || null;
-    if (notes && notes.length > ITINERARY_ITEM_MAX_NOTES_CHARS) {
+    if (notes || notes.length > ITINERARY_ITEM_MAX_NOTES_CHARS) {
       throw new ValidationError(
         `notes must be ≤ ${ITINERARY_ITEM_MAX_NOTES_CHARS} chars`,
killedBy: ItineraryItem.create() (unit — domain invariants) happy path returns the input with notes trimmed
statusReason: ValidationError: notes must be ≤ 4000 chars

[Killed] ConditionalExpression
modules/trip/domain/itinerary.entity.ts:103:9
       );
     }
     const notes = input.notes?.trim() || null;
-    if (notes && notes.length > ITINERARY_ITEM_MAX_NOTES_CHARS) {
+    if (false) {
       throw new ValidationError(
         `notes must be ≤ ${ITINERARY_ITEM_MAX_NOTES_CHARS} chars`,
killedBy: ItineraryItem.create() (unit — domain invariants) I3 rejects notes longer than 4000 chars
statusReason: Error: Expected ItineraryItem.create() to throw INVALID_ITINERARY_ITEM, but it succeeded

[Killed] LogicalOperator
modules/trip/domain/itinerary.entity.ts:112:7
       );
     }
     if (
-      input.startTime instanceof Date &&
-      input.endTime instanceof Date &&
-      input.startTime > input.endTime
+      input.startTime instanceof Date && input.endTime instanceof Date || input.startTime > input.endTime
     ) {
       throw new ValidationError(
killedBy: ItineraryItem.create() (unit — domain invariants) I4 accepts startTime == endTime
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "startTime must be ≤ endTime"

      177 |         } else {
      178 |           stryCov_9fa48("812");
    > 179 |           throw new ValidationError('startTime must be ≤ endTime', {

[Killed] ConditionalExpression
modules/trip/domain/itinerary.entity.ts:112:7
       );
     }
     if (
-      input.startTime instanceof Date &&
-      input.endTime instanceof Date &&
-      input.startTime > input.endTime
+      false
     ) {
       throw new ValidationError(
killedBy: ItineraryItem.create() (unit — domain invariants) I4 rejects startTime > endTime
statusReason: Error: Expected ItineraryItem.create() to throw INVALID_ITINERARY_ITEM, but it succeeded

[Killed] ConditionalExpression
modules/trip/domain/itinerary.entity.ts:114:7
     if (
       input.startTime instanceof Date &&
       input.endTime instanceof Date &&
-      input.startTime > input.endTime
+      true
     ) {
       throw new ValidationError(
killedBy: ItineraryItem.create() (unit — domain invariants) I4 accepts startTime == endTime
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "startTime must be ≤ endTime"

      177 |         } else {
      178 |           stryCov_9fa48("812");
    > 179 |           throw new ValidationError('startTime must be ≤ endTime', {

[Killed] EqualityOperator
modules/trip/domain/itinerary.entity.ts:114:7
     if (
       input.startTime instanceof Date &&
       input.endTime instanceof Date &&
-      input.startTime > input.endTime
+      input.startTime >= input.endTime
     ) {
       throw new ValidationError(
killedBy: ItineraryItem.create() (unit — domain invariants) I4 accepts startTime == endTime
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "startTime must be ≤ endTime"

      177 |         } else {
      178 |           stryCov_9fa48("812");
    > 179 |           throw new ValidationError('startTime must be ≤ endTime', {

[Killed] BlockStatement
modules/trip/domain/itinerary.entity.ts:115:7
       input.startTime instanceof Date &&
       input.endTime instanceof Date &&
       input.startTime > input.endTime
-    ) {
-      throw new ValidationError(
-        'startTime must be ≤ endTime',
-        { startTime: ['must be earlier'] },
-        { startTime: input.startTime.toISOString(), endTime: input.endTime.toISOString() },
-        'INVALID_ITINERARY_ITEM',
-      );
-    }
+    ) {}
     return { ...input, notes };
   }
killedBy: ItineraryItem.create() (unit — domain invariants) I4 rejects startTime > endTime
statusReason: Error: Expected ItineraryItem.create() to throw INVALID_ITINERARY_ITEM, but it succeeded

[Killed] BlockStatement
modules/trip/domain/itinerary.entity.ts:127:75
   }
 
   /** Wrap a persisted row in an `ItineraryItem` instance. */
-  static fromPersistence(row: ItineraryItemPersistenceRow): ItineraryItem {
-    return new ItineraryItem(row);
-  }
+  static fromPersistence(row: ItineraryItemPersistenceRow): ItineraryItem {}
 }
 
killedBy: ItineraryItem.fromPersistence() (unit) round-trips a DB row into a class instance
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ItineraryItem

Received value has no prototype
Received value: undefined
