[Killed] BlockStatement
modules/trip/domain/trip-transitions.ts:41:49
 import type { Trip } from './trip.entity';
 
 /** I-LOCK: throw if `trip` cannot transition to status=published. */
-export function assertCanLock(trip: Trip): void {
-  if (trip.archivedAt !== null) {
-    throw new ConflictError(
-      'Cannot lock an archived trip',
-      { tripId: trip.id, archivedAt: trip.archivedAt.toISOString() },
-      'TRIP_ARCHIVED',
-    );
-  }
-  // status === 'published' is already locked — the use-case may
-  // short-circuit (idempotent). We don't throw here so re-locking
-  // is a no-op rather than a 409. The use-case keeps that policy
-  // call ("if (trip.status === 'published') return trip").
-}
+export function assertCanLock(trip: Trip): void {}
 
 /** I-UNLOCK: throw if `trip` cannot transition to status=draft. */
killedBy: trip-transitions (unit) assertCanLock throws TRIP_ARCHIVED on an archived trip
statusReason: Error: expected throw

[Killed] EqualityOperator
modules/trip/domain/trip-transitions.ts:42:7
 
 /** I-LOCK: throw if `trip` cannot transition to status=published. */
 export function assertCanLock(trip: Trip): void {
-  if (trip.archivedAt !== null) {
+  if (trip.archivedAt === null) {
     throw new ConflictError(
       'Cannot lock an archived trip',
killedBy: trip-transitions (unit) assertCanLock allows a draft trip to be locked
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of null (reading 'toISOString')"

       98 |         throw new ConflictError('Cannot lock an archived trip', {
       99 |           tripId: trip.id,
    > 100 |           archivedAt: trip.archivedAt.toISOString()

[Killed] ConditionalExpression
modules/trip/domain/trip-transitions.ts:42:7
 
 /** I-LOCK: throw if `trip` cannot transition to status=published. */
 export function assertCanLock(trip: Trip): void {
-  if (trip.archivedAt !== null) {
+  if (false) {
     throw new ConflictError(
       'Cannot lock an archived trip',
killedBy: trip-transitions (unit) assertCanLock throws TRIP_ARCHIVED on an archived trip
statusReason: Error: expected throw

[Killed] BlockStatement
modules/trip/domain/trip-transitions.ts:56:51
 }
 
 /** I-UNLOCK: throw if `trip` cannot transition to status=draft. */
-export function assertCanUnlock(trip: Trip): void {
-  if (trip.archivedAt !== null) {
-    throw new ConflictError(
-      'Cannot unlock an archived trip',
-      { tripId: trip.id, archivedAt: trip.archivedAt.toISOString() },
-      'TRIP_ARCHIVED',
-    );
-  }
-}
+export function assertCanUnlock(trip: Trip): void {}
 
 /** I-ARCHIVE: throw if `trip` is already soft-archived. */
killedBy: trip-transitions (unit) assertCanUnlock throws TRIP_ARCHIVED on an archived trip
statusReason: Error: expected throw

[Killed] ConditionalExpression
modules/trip/domain/trip-transitions.ts:57:7
 
 /** I-UNLOCK: throw if `trip` cannot transition to status=draft. */
 export function assertCanUnlock(trip: Trip): void {
-  if (trip.archivedAt !== null) {
+  if (true) {
     throw new ConflictError(
       'Cannot unlock an archived trip',
killedBy: trip-transitions (unit) assertCanUnlock allows a published trip to be unlocked
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of null (reading 'toISOString')"

      122 |         throw new ConflictError('Cannot unlock an archived trip', {
      123 |           tripId: trip.id,
    > 124 |           archivedAt: trip.archivedAt.toISOString()

[Killed] ConditionalExpression
modules/trip/domain/trip-transitions.ts:57:7
 
 /** I-UNLOCK: throw if `trip` cannot transition to status=draft. */
 export function assertCanUnlock(trip: Trip): void {
-  if (trip.archivedAt !== null) {
+  if (false) {
     throw new ConflictError(
       'Cannot unlock an archived trip',
killedBy: trip-transitions (unit) assertCanUnlock throws TRIP_ARCHIVED on an archived trip
statusReason: Error: expected throw

[Killed] BlockStatement
modules/trip/domain/trip-transitions.ts:67:52
 }
 
 /** I-ARCHIVE: throw if `trip` is already soft-archived. */
-export function assertCanArchive(trip: Trip): void {
-  if (trip.archivedAt !== null) {
-    throw new ConflictError(
-      'Trip is already archived',
-      { tripId: trip.id, archivedAt: trip.archivedAt.toISOString() },
-      'TRIP_ALREADY_ARCHIVED',
-    );
-  }
-}
+export function assertCanArchive(trip: Trip): void {}
 
 /** I-UNARCHIVE: throw if `trip` is not currently archived. */
killedBy: trip-transitions (unit) assertCanArchive throws TRIP_ALREADY_ARCHIVED on a soft-archived trip
statusReason: Error: expected throw

[Killed] BlockStatement
modules/trip/domain/trip-transitions.ts:68:33
 
 /** I-ARCHIVE: throw if `trip` is already soft-archived. */
 export function assertCanArchive(trip: Trip): void {
-  if (trip.archivedAt !== null) {
-    throw new ConflictError(
-      'Trip is already archived',
-      { tripId: trip.id, archivedAt: trip.archivedAt.toISOString() },
-      'TRIP_ALREADY_ARCHIVED',
-    );
-  }
+  if (trip.archivedAt !== null) {}
 }
 
killedBy: trip-transitions (unit) assertCanArchive throws TRIP_ALREADY_ARCHIVED on a soft-archived trip
statusReason: Error: expected throw

[Killed] ConditionalExpression
modules/trip/domain/trip-transitions.ts:68:7
 
 /** I-ARCHIVE: throw if `trip` is already soft-archived. */
 export function assertCanArchive(trip: Trip): void {
-  if (trip.archivedAt !== null) {
+  if (false) {
     throw new ConflictError(
       'Trip is already archived',
killedBy: trip-transitions (unit) assertCanArchive throws TRIP_ALREADY_ARCHIVED on a soft-archived trip
statusReason: Error: expected throw

[Killed] BlockStatement
modules/trip/domain/trip-transitions.ts:78:54
 }
 
 /** I-UNARCHIVE: throw if `trip` is not currently archived. */
-export function assertCanUnarchive(trip: Trip): void {
-  if (trip.archivedAt === null) {
-    throw new ConflictError('Trip is not archived', { tripId: trip.id }, 'TRIP_NOT_ARCHIVED');
-  }
-}
+export function assertCanUnarchive(trip: Trip): void {}
 
 /** Pure transform: locked Trip (status=published). Caller persists. */
killedBy: trip-transitions (unit) assertCanUnarchive throws TRIP_NOT_ARCHIVED on a live trip
statusReason: Error: expected throw

[Killed] EqualityOperator
modules/trip/domain/trip-transitions.ts:79:7
 
 /** I-UNARCHIVE: throw if `trip` is not currently archived. */
 export function assertCanUnarchive(trip: Trip): void {
-  if (trip.archivedAt === null) {
+  if (trip.archivedAt !== null) {
     throw new ConflictError('Trip is not archived', { tripId: trip.id }, 'TRIP_NOT_ARCHIVED');
   }
killedBy: trip-transitions (unit) assertCanUnarchive allows an archived trip to be unarchived
statusReason: Error: expect(received).not.toThrow()

Error name:    "ConflictError"
Error message: "Trip is not archived"

      160 |       } else {
      161 |         stryCov_9fa48("849");
    > 162 |         throw new ConflictError('Trip is not archived', {

[Killed] ConditionalExpression
modules/trip/domain/trip-transitions.ts:79:7
 
 /** I-UNARCHIVE: throw if `trip` is not currently archived. */
 export function assertCanUnarchive(trip: Trip): void {
-  if (trip.archivedAt === null) {
+  if (true) {
     throw new ConflictError('Trip is not archived', { tripId: trip.id }, 'TRIP_NOT_ARCHIVED');
   }
killedBy: trip-transitions (unit) assertCanUnarchive allows an archived trip to be unarchived
statusReason: Error: expect(received).not.toThrow()

Error name:    "ConflictError"
Error message: "Trip is not archived"

      160 |       } else {
      161 |         stryCov_9fa48("849");
    > 162 |         throw new ConflictError('Trip is not archived', {

[Killed] BlockStatement
modules/trip/domain/trip-transitions.ts:85:70
 }
 
 /** Pure transform: locked Trip (status=published). Caller persists. */
-export function markLocked(trip: Trip, now: Date = new Date()): Trip {
-  return { ...trip, status: 'published', updatedAt: now };
-}
+export function markLocked(trip: Trip, now: Date = new Date()): Trip {}
 
 /** Pure transform: unlocked Trip (status=draft). Caller persists. */
killedBy: trip-transitions (unit) mark* pure transforms markLocked sets status=published and bumps updatedAt
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
modules/trip/domain/trip-transitions.ts:90:72
 }
 
 /** Pure transform: unlocked Trip (status=draft). Caller persists. */
-export function markUnlocked(trip: Trip, now: Date = new Date()): Trip {
-  return { ...trip, status: 'draft', updatedAt: now };
-}
+export function markUnlocked(trip: Trip, now: Date = new Date()): Trip {}
 
 /** Pure transform: archived Trip (archivedAt stamped). Caller persists. */
killedBy: trip-transitions (unit) mark* pure transforms markUnlocked sets status=draft and bumps updatedAt
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
modules/trip/domain/trip-transitions.ts:95:72
 }
 
 /** Pure transform: archived Trip (archivedAt stamped). Caller persists. */
-export function markArchived(trip: Trip, now: Date = new Date()): Trip {
-  return { ...trip, archivedAt: now, updatedAt: now };
-}
+export function markArchived(trip: Trip, now: Date = new Date()): Trip {}
 
 /** Pure transform: unarchived Trip. Caller persists. */
killedBy: trip-transitions (unit) mark* pure transforms markArchived stamps archivedAt + updatedAt to the same instant
statusReason: TypeError: Cannot read properties of undefined (reading 'archivedAt')

[Killed] BlockStatement
modules/trip/domain/trip-transitions.ts:100:74
 }
 
 /** Pure transform: unarchived Trip. Caller persists. */
-export function markUnarchived(trip: Trip, now: Date = new Date()): Trip {
-  return { ...trip, archivedAt: null, updatedAt: now };
-}
+export function markUnarchived(trip: Trip, now: Date = new Date()): Trip {}
 
killedBy: trip-transitions (unit) mark* pure transforms markUnarchived clears archivedAt and bumps updatedAt
statusReason: TypeError: Cannot read properties of undefined (reading 'archivedAt')
